<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>Python爬虫如何入门</title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="">
    <meta name="author" content="Alex">

    <!-- Le styles -->
    <link rel="stylesheet" href="/theme/css/bootstrap.min.css" type="text/css" />
    <link rel="stylesheet" href="/theme/css/nest.css" type="text/css" />
    <link rel="stylesheet" href="/theme/css/fonts.css" type="text/css" />
    <style type="text/css">
      body {
        padding-top: 60px;
        padding-bottom: 40px;
      }
      .sidebar-nav {
        padding: 9px 0;
      }
      .tag-1 {
        font-size: 13pt;
      }
      .tag-2 {
        font-size: 10pt;
      }
      .tag-2 {
        font-size: 8pt;
      }
      .tag-4 {
        font-size: 6pt;
     }
    </style>
    <link href="/theme/css/bootstrap-responsive.min.css" rel="stylesheet">
        <link href="/theme/css/font-awesome.css" rel="stylesheet">

    <link href="/theme/css/pygments.css" rel="stylesheet">

    <!-- Le HTML5 shim, for IE6-8 support of HTML5 elements -->
    <!--[if lt IE 9]>
      <script src="//html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <!-- Le fav and touch icons -->
    <link rel="shortcut icon" href="/theme/images/favicon.ico">
    <link rel="apple-touch-icon" href="/theme/images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="/theme/images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="/theme/images/apple-touch-icon-114x114.png">

    <link href="/" type="application/atom+xml" rel="alternate" title="Alex's Blog ATOM Feed" />

  </head>

  <body>

    <div class="navbar navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container-fluid">
          <a class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse">
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </a>
          <a class="brand" href="/index.html">Alex's Blog </a>
          <div class="nav-collapse">
            <ul class="nav">
                          <li class="divider-vertical"></li>
                  <li >
                    <a href="/category/linux/">
						<i class="icon-folder-open icon-large"></i>Linux
					</a>
                  </li>
                  <li class="active">
                    <a href="/category/pa-chong-ji-zhu/">
						<i class="icon-folder-open icon-large"></i>爬虫技术
					</a>
                  </li>
                  <li >
                    <a href="/category/pythonji-zhu/">
						<i class="icon-folder-open icon-large"></i>Python技术
					</a>
                  </li>

                          <ul class="nav pull-right">
                                <li><a href="/archives.html"><i class="icon-th-list"></i>文章列表</a></li>
                          </ul>

            </ul>
            <!--<p class="navbar-text pull-right">Logged in as <a href="#">username</a></p>-->
          </div><!--/.nav-collapse -->
        </div>
      </div>
    </div>

    <div class="container-fluid">
      <div class="row">
        <div class="span9" id="content">
<section id="content">
        <article>
                <header>
                        <h1>
                                <a href=""
                                        rel="bookmark"
                                        title="Permalink to Python爬虫如何入门">
                                        Python爬虫如何入门
                                </a>
                        </h1>
                </header>
                <div class="entry-content">
                <div class="well">
<footer class="post-info">
<span class="label">Date</span>
<abbr class="published" title="2017-08-18T00:00:00+08:00">
        <i class="icon-calendar"></i>Fri 18 August 2017
</abbr>
<span class="label">By</span>
<a href="/author/alex/"><i class="icon-user"></i>Alex</a>
<span class="label">Category</span>
<a href="/category/pa-chong-ji-zhu/"><i class="icon-folder-open"></i>爬虫技术</a>.


<span class="label">Tags</span>
	<a href="/tag/pa-chong/"><i class="icon-tag"></i>爬虫</a>
</footer><!-- /.post-info -->                </div>
                <article>
        <p>&#23398;&#29228;&#34411;&#26159;&#24490;&#24207;&#28176;&#36827;&#30340;&#36807;&#31243;&#65292;&#20316;&#20026;&#38646;&#22522;&#30784;&#23567;&#30333;&#65292;&#22823;&#20307;&#19978;&#21487;&#20998;&#20026;&#19977;&#20010;&#38454;&#27573;&#65292;&#31532;&#19968;&#38454;&#27573;&#26159;&#20837;&#38376;&#65292;&#25484;&#25569;&#24517;&#22791;&#30340;&#22522;&#30784;&#30693;&#35782;&#65292;&#31532;&#20108;&#38454;&#27573;&#26159;&#27169;&#20223;&#65292;&#36319;&#30528;&#21035;&#20154;&#30340;&#29228;&#34411;&#20195;&#30721;&#23398;&#65292;&#24324;&#25026;&#27599;&#19968;&#34892;&#20195;&#30721;&#65292;&#31532;&#19977;&#38454;&#27573;&#26159;&#33258;&#24049;&#21160;&#25163;&#65292;&#36825;&#20010;&#38454;&#27573;&#20320;&#24320;&#22987;&#26377;&#33258;&#24049;&#30340;&#35299;&#39064;&#24605;&#36335;&#20102;&#65292;&#21487;&#20197;&#29420;&#31435;&#35774;&#35745;&#29228;&#34411;&#31995;&#32479;&#12290;</p>
<p>&#29228;&#34411;&#28041;&#21450;&#30340;&#25216;&#26415;&#21253;&#25324;&#20294;&#19981;&#38480;&#20110;&#29087;&#32451;&#19968;&#38376;&#32534;&#31243;&#35821;&#35328;&#65288;&#36825;&#37324;&#20197; Python &#20026;&#20363;&#65289; HTML &#30693;&#35782;&#12289;HTTP/HTTPS &#21327;&#35758;&#30340;&#22522;&#26412;&#30693;&#35782;&#12289;&#27491;&#21017;&#34920;&#36798;&#24335;&#12289;&#25968;&#25454;&#24211;&#30693;&#35782;&#65292;&#24120;&#29992;&#25235;&#21253;&#24037;&#20855;&#30340;&#20351;&#29992;&#12289;&#29228;&#34411;&#26694;&#26550;&#30340;&#20351;&#29992;&#12289;&#28041;&#21450;&#21040;&#22823;&#35268;&#27169;&#29228;&#34411;&#65292;&#36824;&#38656;&#35201;&#20102;&#35299;&#20998;&#24067;&#24335;&#30340;&#27010;&#24565;&#12289;&#28040;&#24687;&#38431;&#21015;&#12289;&#24120;&#29992;&#30340;&#25968;&#25454;&#32467;&#26500;&#21644;&#31639;&#27861;&#12289;&#32531;&#23384;&#65292;&#29978;&#33267;&#36824;&#21253;&#25324;&#26426;&#22120;&#23398;&#20064;&#30340;&#24212;&#29992;&#65292;&#22823;&#35268;&#27169;&#30340;&#31995;&#32479;&#32972;&#21518;&#37117;&#26159;&#38752;&#24456;&#22810;&#25216;&#26415;&#26469;&#25903;&#25745;&#30340;&#12290;&#29228;&#34411;&#21482;&#26159;&#20026;&#20102;&#33719;&#21462;&#25968;&#25454;&#65292;&#20998;&#26512;&#12289;&#25366;&#25496;&#36825;&#20123;&#25968;&#25454;&#25165;&#26159;&#20215;&#20540;&#65292;&#22240;&#27492;&#23427;&#36824;&#21487;&#20197;&#24310;&#20280;&#21040;&#25968;&#25454;&#20998;&#26512;&#12289;&#25968;&#25454;&#25366;&#25496;&#31561;&#39046;&#22495;&#65292;&#32473;&#20225;&#19994;&#20570;&#20915;&#31574;&#65292;&#25152;&#20197;&#20316;&#20026;&#19968;&#21517;&#29228;&#34411;&#24037;&#31243;&#24072;&#65292;&#26159;&#22823;&#26377;&#21487;&#20026;&#30340;&#12290;</p>
<p>&#37027;&#20040;&#26159;&#19981;&#26159;&#19968;&#23450;&#35201;&#25226;&#19978;&#38754;&#30340;&#30693;&#35782;&#20840;&#23398;&#23436;&#20102;&#25165;&#21487;&#20197;&#24320;&#22987;&#20889;&#29228;&#34411;&#21527;&#65311;&#24403;&#28982;&#19981;&#26159;&#65292;&#23398;&#20064;&#26159;&#19968;&#36744;&#23376;&#30340;&#20107;&#65292;&#21482;&#35201;&#20320;&#20250;&#20889; Python &#20195;&#30721;&#20102;&#65292;&#23601;&#30452;&#25509;&#19978;&#25163;&#29228;&#34411;&#65292;&#22909;&#27604;&#23398;&#36710;&#65292;&#21482;&#35201;&#33021;&#24320;&#21160;&#20102;&#23601;&#19978;&#36335;&#21543;&#65292;&#24403;&#28982;&#20889;&#20195;&#30721;&#21487;&#27604;&#24320;&#36710;&#23433;&#20840;&#22810;&#20102;&#12290;</p>
<p>&#29992; Python &#20889;&#29228;&#34411;&#65292;&#39318;&#20808;&#38656;&#35201;&#20250; Python&#65292;&#25226;&#22522;&#30784;&#35821;&#27861;&#25630;&#25026;&#65292;&#30693;&#36947;&#24590;&#20040;&#20351;&#29992;&#20989;&#25968;&#12289;&#31867;&#21644;&#24120;&#29992;&#30340;&#25968;&#25454;&#32467;&#26500;&#22914; list&#12289;dict &#20013;&#30340;&#24120;&#29992;&#26041;&#27861;&#23601;&#31639;&#22522;&#26412;&#20837;&#38376;&#12290;&#25509;&#30528;&#20320;&#38656;&#35201;&#20102;&#35299; HTML&#65292;HTML &#23601;&#26159;&#19968;&#20010;&#25991;&#26723;&#26641;&#32467;&#26500;&#65292;&#32593;&#19978;&#26377;&#20010; <a href="https://deerchao.net/tutorials/html/html.htm">HTML 30&#20998;&#38047;&#20837;&#38376;&#25945;&#31243;</a> &#22815;&#29992;&#20102;&#12290;&#28982;&#21518;&#26159;&#20851;&#20110; HTTP &#30340;&#30693;&#35782;&#65292;&#29228;&#34411;&#22522;&#26412;&#21407;&#29702;&#23601;&#26159;&#36890;&#36807;&#32593;&#32476;&#35831;&#27714;&#20174;&#36828;&#31243;&#26381;&#21153;&#22120;&#19979;&#36733;&#25968;&#25454;&#30340;&#36807;&#31243;&#65292;&#32780;&#36825;&#20010;&#32593;&#32476;&#35831;&#27714;&#32972;&#21518;&#30340;&#25216;&#26415;&#23601;&#26159;&#22522;&#20110; HTTP &#21327;&#35758;&#12290;&#20316;&#20026;&#20837;&#38376;&#29228;&#34411;&#26469;&#35828;&#65292;&#20320;&#38656;&#35201;&#20102;&#35299; HTTP&#21327;&#35758;&#30340;&#22522;&#26412;&#21407;&#29702;&#65292;&#34429;&#28982; HTTP &#35268;&#33539;&#29992;&#19968;&#26412;&#20070;&#37117;&#20889;&#19981;&#23436;&#65292;&#20294;&#28145;&#20837;&#30340;&#20869;&#23481;&#21487;&#20197;&#25918;&#20197;&#21518;&#24930;&#24930;&#21435;&#30475;&#65292;&#29702;&#35770;&#19982;&#23454;&#36341;&#30456;&#32467;&#21512;&#12290;</p>
<p>&#32593;&#32476;&#35831;&#27714;&#26694;&#26550;&#37117;&#26159;&#23545; HTTP &#21327;&#35758;&#30340;&#23454;&#29616;&#65292;&#27604;&#22914;&#33879;&#21517;&#30340;&#32593;&#32476;&#35831;&#27714;&#24211; Requests &#23601;&#26159;&#19968;&#20010;&#27169;&#25311;&#27983;&#35272;&#22120;&#21457;&#36865; HTTP &#35831;&#27714;&#30340;&#32593;&#32476;&#24211;&#12290;&#20102;&#35299; HTTP &#21327;&#35758;&#20043;&#21518;&#65292;&#20320;&#23601;&#21487;&#20197;&#19987;&#38376;&#26377;&#38024;&#23545;&#24615;&#30340;&#23398;&#20064;&#21644;&#32593;&#32476;&#30456;&#20851;&#30340;&#27169;&#22359;&#20102;&#65292;&#27604;&#22914; Python &#33258;&#24102;&#26377; urllib&#12289;urllib2&#65288;Python3&#20013;&#30340;urllib&#65289;&#65292;httplib&#65292;Cookie&#31561;&#20869;&#23481;&#65292;&#24403;&#28982;&#20320;&#21487;&#20197;&#30452;&#25509;&#36339;&#36807;&#36825;&#20123;&#65292;&#30452;&#25509;&#23398;&#20064; Requests &#24590;&#20040;&#29992;&#65292;&#21069;&#25552;&#26159;&#20320;&#29087;&#24713;&#20102; HTTP&#21327;&#35758;&#30340;&#22522;&#26412;&#20869;&#23481;&#12290;&#36825;&#37324;&#19981;&#24471;&#19981;&#25512;&#33616;&#30340;&#19968;&#26412;&#20070;&#26159;&#12298;&#22270;&#35299;HTTP&#12299;&#12290;&#25968;&#25454;&#29228;&#19979;&#26469;&#65292;&#22823;&#37096;&#20998;&#24773;&#20917;&#26159; HTML &#25991;&#26412;&#65292;&#20063;&#26377;&#23569;&#25968;&#26159;&#22522;&#20110; XML &#26684;&#24335;&#25110;&#32773; Json &#26684;&#24335;&#30340;&#25968;&#25454;&#65292;&#35201;&#24819;&#27491;&#30830;&#22788;&#29702;&#36825;&#20123;&#25968;&#25454;&#65292;&#20320;&#35201;&#29087;&#24713;&#27599;&#31181;&#25968;&#25454;&#31867;&#22411;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#27604;&#22914;JSON&#25968;&#25454;&#21487;&#20197;&#30452;&#25509;&#20351;&#29992; Python&#33258;&#24102;&#30340;&#27169;&#22359; json&#65292;&#23545;&#20110; HTML &#25968;&#25454;&#65292;&#21487;&#20197;&#20351;&#29992; BeautifulSoup&#12289;lxml &#31561;&#24211;&#21435;&#22788;&#29702;&#65292;&#23545;&#20110; xml &#25968;&#25454;&#65292;&#38500;&#20102;&#21487;&#20197;&#20351;&#29992; untangle&#12289;xmltodict&#31561;&#31532;&#19977;&#26041;&#24211;&#12290;</p>
<p>&#20837;&#38376;&#29228;&#34411;&#65292;&#23398;&#20064;&#27491;&#21017;&#34920;&#36798;&#24335;&#24182;&#19981;&#26159;&#24517;&#39035;&#30340;&#65292;&#20320;&#21487;&#20197;&#22312;&#20320;&#30495;&#27491;&#38656;&#35201;&#30340;&#26102;&#20505;&#20877;&#21435;&#23398;&#65292;&#27604;&#22914;&#20320;&#25226;&#25968;&#25454;&#29228;&#21462;&#22238;&#26469;&#21518;&#65292;&#38656;&#35201;&#23545;&#25968;&#25454;&#36827;&#34892;&#28165;&#27927;&#65292;&#24403;&#20320;&#21457;&#29616;&#20351;&#29992;&#24120;&#35268;&#30340;&#23383;&#31526;&#20018;&#25805;&#20316;&#26041;&#27861;&#26681;&#26412;&#27809;&#27861;&#22788;&#29702;&#26102;&#65292;&#36825;&#26102;&#20320;&#21487;&#20197;&#23581;&#35797;&#20102;&#35299;&#19968;&#19979;&#27491;&#21017;&#34920;&#36798;&#24335;&#65292;&#24448;&#24448;&#23427;&#33021;&#36215;&#21040;&#20107;&#21322;&#21151;&#20493;&#30340;&#25928;&#26524;&#12290;Python &#30340; re &#27169;&#22359;&#21487;&#29992;&#26469;&#22788;&#29702;&#27491;&#21017;&#34920;&#36798;&#24335;&#12290;&#36825;&#37324;&#20063;&#25512;&#33616;&#20960;&#20010;&#25945;&#31243;&#65306;<a href="https://deerchao.net/tutorials/regex/regex.htm">&#27491;&#21017;&#34920;&#36798;&#24335;30&#20998;&#38047;&#20837;&#38376;&#25945;&#31243;</a> <a href="https://www.cnblogs.com/huxi/archive/2010/07/04/1771073.html">Python&#27491;&#21017;&#34920;&#36798;&#24335;&#25351;&#21335;</a> <a href="https://foofish.net/re-tutorial.html">&#27491;&#21017;&#34920;&#36798;&#24335;&#23436;&#20840;&#25351;&#21335;</a></p>
<p>&#25968;&#25454;&#28165;&#27927;&#23436;&#26368;&#32456;&#35201;&#36827;&#34892;&#25345;&#20037;&#21270;&#23384;&#20648;&#65292;&#20320;&#21487;&#20197;&#29992;&#25991;&#20214;&#23384;&#20648;&#65292;&#27604;&#22914;CSV&#25991;&#20214;&#65292;&#20063;&#21487;&#20197;&#29992;&#25968;&#25454;&#24211;&#23384;&#20648;&#65292;&#31616;&#21333;&#30340;&#29992; sqlite&#65292;&#19987;&#19994;&#28857;&#29992; MySQL&#65292;&#25110;&#32773;&#26159;&#20998;&#24067;&#24335;&#30340;&#25991;&#26723;&#25968;&#25454;&#24211; MongoDB&#65292;&#36825;&#20123;&#25968;&#25454;&#24211;&#23545;Python&#37117;&#38750;&#24120;&#21451;&#22909;&#65292;&#26377;&#29616;&#25104;&#30340;&#24211;&#25903;&#25345;&#12290; <a href="http://www.imooc.com/learn/475">Python&#25805;&#20316;MySQL&#25968;&#25454;&#24211;</a> <a href="https://moreoronce.gitbooks.io/learnpython/content/300/302.html">&#36890;&#36807;Python&#36830;&#25509;&#25968;&#25454;&#24211;</a></p>
<p>&#20174;&#25968;&#25454;&#30340;&#25235;&#21462;&#21040;&#28165;&#27927;&#20877;&#21040;&#23384;&#20648;&#30340;&#22522;&#26412;&#27969;&#31243;&#37117;&#36208;&#23436;&#20102;&#65292;&#20063;&#31639;&#26159;&#22522;&#26412;&#20837;&#38376;&#20102;&#65292;&#25509;&#19979;&#26469;&#23601;&#26159;&#32771;&#39564;&#20869;&#21151;&#30340;&#26102;&#20505;&#20102;&#65292;&#24456;&#22810;&#32593;&#31449;&#37117;&#35774;&#26377;&#21453;&#29228;&#34411;&#31574;&#30053;&#65292;&#20182;&#20204;&#24819;&#26041;&#35774;&#27861;&#38459;&#27490;&#20320;&#29992;&#38750;&#27491;&#24120;&#25163;&#27573;&#33719;&#21462;&#25968;&#25454;&#65292;&#27604;&#22914;&#20250;&#26377;&#21508;&#31181;&#22855;&#22855;&#24618;&#24618;&#30340;&#39564;&#35777;&#30721;&#38480;&#21046;&#20320;&#30340;&#35831;&#27714;&#25805;&#20316;&#12289;&#23545;&#35831;&#27714;&#36895;&#24230;&#20570;&#38480;&#21046;&#65292;&#23545;IP&#20570;&#38480;&#21046;&#12289;&#29978;&#33267;&#23545;&#25968;&#25454;&#36827;&#34892;&#21152;&#23494;&#25805;&#20316;&#65292;&#24635;&#20043;&#65292;&#23601;&#26159;&#20026;&#20102;&#25552;&#39640;&#33719;&#21462;&#25968;&#25454;&#30340;&#25104;&#26412;&#12290;&#36825;&#26102;&#20320;&#38656;&#35201;&#25484;&#25569;&#30340;&#30693;&#35782;&#23601;&#35201;&#26356;&#22810;&#20102;&#65292;&#20320;&#38656;&#35201;&#28145;&#20837;&#29702;&#35299; HTTP &#21327;&#35758;&#65292;&#20320;&#38656;&#35201;&#29702;&#35299;&#24120;&#35265;&#30340;&#21152;&#35299;&#23494;&#31639;&#27861;&#65292;&#20320;&#35201;&#29702;&#35299; HTTP &#20013;&#30340; cookie&#65292;HTTP &#20195;&#29702;&#65292;HTTP&#20013;&#30340;&#21508;&#31181;HEADER&#12290;&#29228;&#34411;&#19982;&#21453;&#29228;&#34411;&#23601;&#26159;&#30456;&#29233;&#30456;&#26432;&#30340;&#19968;&#23545;&#65292;&#36947;&#39640;&#19968;&#27425;&#39764;&#39640;&#19968;&#19976;&#12290;&#22914;&#20309;&#24212;&#23545;&#21453;&#29228;&#34411;&#27809;&#26377;&#26082;&#23450;&#30340;&#32479;&#19968;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#38752;&#30340;&#26159;&#20320;&#30340;&#32463;&#39564;&#20197;&#21450;&#20320;&#25152;&#25484;&#25569;&#30340;&#30693;&#35782;&#20307;&#31995;&#12290;&#36825;&#19981;&#26159;&#20165;&#20973;21&#22825;&#20837;&#38376;&#25945;&#31243;&#23601;&#33021;&#36798;&#21040;&#30340;&#39640;&#24230;&#12290;</p>
<p>&#25968;&#25454;&#32467;&#26500;&#21644;&#31639;&#27861;</p>
<p>&#36827;&#34892;&#22823;&#35268;&#27169;&#29228;&#34411;&#65292;&#36890;&#24120;&#37117;&#26159;&#20174;&#19968;&#20010;URL&#24320;&#22987;&#29228;&#65292;&#28982;&#21518;&#25226;&#39029;&#38754;&#20013;&#35299;&#26512;&#30340;URL&#38142;&#25509;&#21152;&#20837;&#24453;&#29228;&#30340;URL&#38598;&#21512;&#20013;&#65292;&#25105;&#20204;&#38656;&#35201;&#29992;&#21040;&#38431;&#21015;&#25110;&#32773;&#20248;&#20808;&#38431;&#21015;&#26469;&#21306;&#21035;&#23545;&#24453;&#26377;&#20123;&#32593;&#31449;&#20248;&#20808;&#29228;&#65292;&#26377;&#20123;&#32593;&#31449;&#21518;&#38754;&#29228;&#12290;&#27599;&#29228;&#21435;&#19968;&#20010;&#39029;&#38754;&#65292;&#26159;&#20351;&#29992;&#28145;&#24230;&#20248;&#20808;&#36824;&#26159;&#24191;&#24230;&#20248;&#20808;&#31639;&#27861;&#29228;&#21462;&#19979;&#19968;&#20010;&#38142;&#25509;&#12290;&#27599;&#27425;&#21457;&#36215;&#32593;&#32476;&#35831;&#27714;&#30340;&#26102;&#20505;&#65292;&#20250;&#28041;&#21450;&#21040;&#19968;&#20010;DNS&#30340;&#35299;&#26512;&#36807;&#31243;&#65288;&#23558;&#32593;&#22336;&#36716;&#25442;&#25104;IP&#65289;&#20026;&#20102;&#36991;&#20813;&#37325;&#22797;&#22320; DNS &#35299;&#26512;&#65292;&#25105;&#20204;&#38656;&#35201;&#25226;&#35299;&#26512;&#22909;&#30340; IP &#32531;&#23384;&#19979;&#26469;&#12290;URL&#37027;&#20040;&#22810;&#65292;&#22914;&#20309;&#21028;&#26029;&#21738;&#20123;&#32593;&#22336;&#24050;&#32463;&#29228;&#36807;&#65292;&#21738;&#20123;&#27809;&#26377;&#29228;&#36807;&#65292;&#31616;&#21333;&#28857;&#23601;&#26159;&#26159;&#20351;&#29992;&#23383;&#20856;&#32467;&#26500;&#26469;&#23384;&#20648;&#24050;&#32463;&#29228;&#36807;&#30340;&#30340;URL&#65292;&#20294;&#26159;&#22914;&#26524;&#30896;&#36807;&#28023;&#37327;&#30340;URL&#26102;&#65292;&#23383;&#20856;&#21344;&#29992;&#30340;&#20869;&#23384;&#31354;&#38388;&#38750;&#24120;&#22823;&#65292;&#27492;&#26102;&#20320;&#38656;&#35201;&#32771;&#34385;&#20351;&#29992; Bloom Filter&#65288;&#24067;&#38534;&#36807;&#28388;&#22120;&#65289;&#65292;&#29992;&#19968;&#20010;&#32447;&#31243;&#36880;&#20010;&#22320;&#29228;&#21462;&#25968;&#25454;&#65292;&#25928;&#29575;&#20302;&#24471;&#21487;&#24604;&#65292;&#22914;&#26524;&#25552;&#39640;&#29228;&#34411;&#25928;&#29575;&#65292;&#26159;&#20351;&#29992;&#22810;&#32447;&#31243;&#65292;&#22810;&#36827;&#31243;&#36824;&#26159;&#21327;&#31243;&#65292;&#36824;&#26159;&#20998;&#24067;&#24335;&#25805;&#20316;&#12290;</p>
<p>&#20851;&#20110;&#23454;&#36341;</p>
<p>&#32593;&#19978;&#30340;&#29228;&#34411;&#25945;&#31243;&#22810;&#22914;&#29275;&#27611;&#65292;&#21407;&#29702;&#22823;&#20307;&#30456;&#21516;&#65292;&#21482;&#19981;&#36807;&#26159;&#25442;&#20010;&#19981;&#21516;&#30340;&#32593;&#31449;&#36827;&#34892;&#29228;&#21462;&#65292;&#20320;&#21487;&#20197;&#36319;&#30528;&#32593;&#19978;&#30340;&#25945;&#31243;&#23398;&#20064;&#27169;&#25311;&#30331;&#24405;&#19968;&#20010;&#32593;&#31449;&#65292;&#27169;&#25311;&#25171;&#21345;&#20043;&#31867;&#30340;&#65292;&#29228;&#20010;&#35910;&#29923;&#30340;&#30005;&#24433;&#12289;&#20070;&#31821;&#20043;&#31867;&#30340;&#12290;&#36890;&#36807;&#19981;&#26029;&#22320;&#32451;&#20064;&#65292;&#20174;&#36935;&#21040;&#38382;&#39064;&#21040;&#35299;&#20915;&#38382;&#39064;&#65292;&#36825;&#26679;&#30340;&#25910;&#33719;&#30475;&#20070;&#27809;&#27861;&#27604;&#25311;&#30340;&#12290;</p>
<p>&#29228;&#34411;&#24120;&#29992;&#24211;</p>
<ul>
<li>urllib&#12289;urlib2&#65288;Python&#20013;&#30340;urllib&#65289;python&#20869;&#24314;&#30340;&#32593;&#32476;&#35831;&#27714;&#24211;</li>
<li>urllib3&#65306;&#32447;&#31243;&#23433;&#20840;&#30340;HTTP&#32593;&#32476;&#35831;&#27714;&#24211;</li>
<li>requests&#65306;&#20351;&#29992;&#26368;&#24191;&#27867;&#30340;&#32593;&#32476;&#35831;&#27714;&#24211;&#65292;&#20860;&#23481;py2&#21644;py3</li>
<li>grequests&#65306;&#24322;&#27493;&#30340;requests</li>
<li>BeautifulSoup&#65306;HTML&#12289;XML&#25805;&#20316;&#35299;&#26512;&#24211;</li>
<li>lxml&#65306;&#21478;&#19968;&#31181;&#22788;&#29702; HTML&#12289;XML&#30340;&#26041;&#24335;</li>
<li>tornado&#65306;&#24322;&#27493;&#32593;&#32476;&#26694;&#26550;</li>
<li>Gevent&#65306;&#24322;&#27493;&#32593;&#32476;&#26694;&#26550;</li>
<li>Scrapy&#65306;&#26368;&#27969;&#34892;&#30340;&#29228;&#34411;&#26694;&#26550;</li>
<li>pyspider&#65306;&#29228;&#34411;&#26694;&#26550;</li>
<li>xmltodict&#65306;xml&#36716;&#25442;&#25104;&#23383;&#20856;</li>
<li>pyquery&#65306;&#20687;jQuery&#19968;&#26679;&#25805;&#20316;HTML</li>
<li>Jieba &#65306;&#20998;&#35789;</li>
<li>SQLAlchemy&#65306;ORM&#26694;&#26550;</li>
<li>celery &#65306;&#28040;&#24687;&#38431;&#21015;</li>
<li>rq&#65306;&#31616;&#21333;&#28040;&#24687;&#38431;&#21015;</li>
<li>python-goose &#65306;&#20174;HTML&#20013;&#25552;&#21462;&#25991;&#26412;</li>
</ul>
<p>&#20070;&#31821;</p>
<ul>
<li>&#12298;&#22270;&#35299;HTTP&#12299;</li>
<li>&#12298;HTTP&#26435;&#23041;&#25351;&#21335;&#12299;</li>
<li>&#12298;&#35745;&#31639;&#26426;&#32593;&#32476;&#65306;&#33258;&#39030;&#21521;&#19979;&#26041;&#27861;&#12299;</li>
<li>&#12298;&#29992;Python&#20889;&#32593;&#32476;&#29228;&#34411;&#12299;</li>
<li>&#12298;Python&#32593;&#32476;&#25968;&#25454;&#37319;&#38598;&#12299;</li>
<li>&#12298;&#31934;&#36890;&#27491;&#21017;&#34920;&#36798;&#24335;&#12299;</li>
<li>&#12298;Python&#20837;&#38376;&#21040;&#23454;&#36341;&#12299;</li>
<li>&#12298;&#33258;&#24049;&#21160;&#25163;&#20889;&#32593;&#32476;&#29228;&#34411;&#12299;</li>
<li>&#12298;Crypto101&#12299;</li>
<li>&#12298;&#22270;&#35299;&#23494;&#30721;&#25216;&#26415;&#12299;</li>
</ul>
<p>&#25945;&#31243;</p>
<ul>
<li><a href="http://cuiqingcai.com/1052.html">Python&#29228;&#34411;&#23398;&#20064;&#31995;&#21015;&#25945;&#31243;</a></li>
<li><a href="https://github.com/lining0806/PythonSpiderNotes">Python&#20837;&#38376;&#32593;&#32476;&#29228;&#34411;&#20043;&#31934;&#21326;&#29256;</a></li>
<li><a href="http://blog.csdn.net/pleasecallmewhy/article/details/8922826">Python&#32593;&#32476;&#29228;&#34411;</a></li>
<li><a href="https://foofish.net/understand-http.html">&#29228;&#34411;&#20837;&#38376;&#31995;&#21015;</a></li>
</ul>
        <br/>
        </article>

<p>Original:https://foofish.net/python-crawler.html</p>
                </div><!-- /.entry-content -->
                <!-- 来必力City版安装代码 -->
                <div id="lv-container" data-id="city" data-uid="MTAyMC8zNjgwNi8xMzM0Mg==">
                    <script type="text/javascript">
                   (function(d, s) {
                       var j, e = d.getElementsByTagName(s)[0];

                       if (typeof LivereTower === 'function') { return; }

                       j = d.createElement(s);
                       j.src = 'https://cdn-city.livere.com/js/embed.dist.js';
                       j.async = true;

                       e.parentNode.insertBefore(j, e);
                   })(document, 'script');
                    </script>
                <noscript> 为正常使用来必力评论功能请激活JavaScript</noscript>
                </div>
                <!-- City版安装代码已完成 -->
        </article>
</section>
        </div><!--/span-->

                <div class="span3 well sidebar-nav" id="sidebar">
<ul class="nav nav-list">
<li class="nav-header"><h4><i class="icon-external-link"></i>blogroll</h4></li>
    <li><a href="http://getpelican.com/"><i class="icon-external-link"></i>Pelican</a></li>
    <li><a href="http://python.org/"><i class="icon-external-link"></i>Python.org</a></li>
    <li><a href="http://jinja.pocoo.org/"><i class="icon-external-link"></i>Jinja2</a></li>
    <li><a href="http://www.runoob.com/"><i class="icon-external-link"></i>Python教程</a></li>
    <li><a href="https://www.liaoxuefeng.com/wiki/0014316089557264a6b348958f449949df42a6d3a2e542c000"><i class="icon-external-link"></i>廖雪峰Python</a></li>
    <li><a href="https://foofish.net/"><i class="icon-external-link"></i>FOOFISH-PYTHON之禅</a></li>
<li class="nav-header"><h4><i class="icon-home icon-large"></i> social</h4></li>
<li><a href="/feeds/all.atom.xml" rel="alternate"><i class="icon-bookmark icon-large"></i>atom feed</a></li>
    <li><a href="https://github.com/RuiJee"><i class="icon-Github-sign icon-large"></i>Github</a></li>

<li class="nav-header"><h4><i class="icon-folder-close icon-large"></i>Categories</h4></li>
<li>
<a href="/category/linux/">
    <i class="icon-folder-open icon-large"></i>Linux
</a>
</li>
<li>
<a href="/category/pa-chong-ji-zhu/">
    <i class="icon-folder-open icon-large"></i>爬虫技术
</a>
</li>
<li>
<a href="/category/pythonji-zhu/">
    <i class="icon-folder-open icon-large"></i>Python技术
</a>
</li>

<li class="nav-header"><h4><i class="icon-tags icon-large"></i>Tags</h4></li>
<li class="tag-4">
    <a href="/tag/extractor/">
        <i class="icon-tag icon-large"></i>extractor
    </a>
</li>
<li class="tag-4">
    <a href="/tag/str/">
        <i class="icon-tag icon-large"></i>str
    </a>
</li>
<li class="tag-4">
    <a href="/tag/zhi-hu/">
        <i class="icon-tag icon-large"></i>知乎
    </a>
</li>
<li class="tag-4">
    <a href="/tag/pip/">
        <i class="icon-tag icon-large"></i>pip
    </a>
</li>
<li class="tag-3">
    <a href="/tag/han-shu/">
        <i class="icon-tag icon-large"></i>函数
    </a>
</li>
<li class="tag-4">
    <a href="/tag/legb/">
        <i class="icon-tag icon-large"></i>legb
    </a>
</li>
<li class="tag-2">
    <a href="/tag/bian-ma/">
        <i class="icon-tag icon-large"></i>编码
    </a>
</li>
<li class="tag-4">
    <a href="/tag/beautifulsoup/">
        <i class="icon-tag icon-large"></i>beautifulsoup
    </a>
</li>
<li class="tag-2">
    <a href="/tag/zhuang-shi-qi/">
        <i class="icon-tag icon-large"></i>装饰器
    </a>
</li>
<li class="tag-4">
    <a href="/tag/decorator/">
        <i class="icon-tag icon-large"></i>decorator
    </a>
</li>
<li class="tag-3">
    <a href="/tag/pycharm/">
        <i class="icon-tag icon-large"></i>pycharm
    </a>
</li>
<li class="tag-4">
    <a href="/tag/thread/">
        <i class="icon-tag icon-large"></i>thread
    </a>
</li>
<li class="tag-3">
    <a href="/tag/requests/">
        <i class="icon-tag icon-large"></i>requests
    </a>
</li>
<li class="tag-2">
    <a href="/tag/http/">
        <i class="icon-tag icon-large"></i>http
    </a>
</li>
<li class="tag-4">
    <a href="/tag/re/">
        <i class="icon-tag icon-large"></i>re
    </a>
</li>
<li class="tag-3">
    <a href="/tag/dict/">
        <i class="icon-tag icon-large"></i>dict
    </a>
</li>
<li class="tag-1">
    <a href="/tag/pa-chong/">
        <i class="icon-tag icon-large"></i>爬虫
    </a>
</li>
<li class="tag-4">
    <a href="/tag/singleton/">
        <i class="icon-tag icon-large"></i>singleton
    </a>
</li>
<li class="tag-4">
    <a href="/tag/iterable/">
        <i class="icon-tag icon-large"></i>iterable
    </a>
</li>
<li class="tag-4">
    <a href="/tag/for/">
        <i class="icon-tag icon-large"></i>for
    </a>
</li>
<li class="tag-4">
    <a href="/tag/book/">
        <i class="icon-tag icon-large"></i>book
    </a>
</li>
<li class="tag-4">
    <a href="/tag/int/">
        <i class="icon-tag icon-large"></i>int
    </a>
</li>
<li class="tag-4">
    <a href="/tag/bi-bao/">
        <i class="icon-tag icon-large"></i>闭包
    </a>
</li>
<li class="tag-3">
    <a href="/tag/iterator/">
        <i class="icon-tag icon-large"></i>iterator
    </a>
</li>
<li class="tag-4">
    <a href="/tag/tuple/">
        <i class="icon-tag icon-large"></i>tuple
    </a>
</li>
<li class="tag-0">
    <a href="/tag/python/">
        <i class="icon-tag icon-large"></i>python
    </a>
</li>
<li class="tag-4">
    <a href="/tag/shu/">
        <i class="icon-tag icon-large"></i>书
    </a>
</li>
<li class="tag-4">
    <a href="/tag/free/">
        <i class="icon-tag icon-large"></i>free
    </a>
</li>
<li class="tag-2">
    <a href="/tag/shi-xian-yuan-li/">
        <i class="icon-tag icon-large"></i>实现原理
    </a>
</li>
<li class="tag-4">
    <a href="/tag/gc/">
        <i class="icon-tag icon-large"></i>gc
    </a>
</li>
<li class="tag-4">
    <a href="/tag/centos/">
        <i class="icon-tag icon-large"></i>centos
    </a>
</li>
<li class="tag-3">
    <a href="/tag/generator/">
        <i class="icon-tag icon-large"></i>generator
    </a>
</li>
<li class="tag-4">
    <a href="/tag/timestamp/">
        <i class="icon-tag icon-large"></i>timestamp
    </a>
</li>
<li class="tag-4">
    <a href="/tag/with/">
        <i class="icon-tag icon-large"></i>with
    </a>
</li>
<li class="tag-4">
    <a href="/tag/ru-men/">
        <i class="icon-tag icon-large"></i>入门
    </a>
</li>
<li class="tag-4">
    <a href="/tag/zuo-yong-yu/">
        <i class="icon-tag icon-large"></i>作用域
    </a>
</li>
<li class="tag-4">
    <a href="/tag/zheng-ze-biao-da-shi/">
        <i class="icon-tag icon-large"></i>正则表达式
    </a>
</li>
<li class="tag-4">
    <a href="/tag/method/">
        <i class="icon-tag icon-large"></i>method
    </a>
</li>
<li class="tag-3">
    <a href="/tag/suan-fa/">
        <i class="icon-tag icon-large"></i>算法
    </a>
</li>
<li class="tag-4">
    <a href="/tag/django/">
        <i class="icon-tag icon-large"></i>django
    </a>
</li>
<li class="tag-4">
    <a href="/tag/stringio/">
        <i class="icon-tag icon-large"></i>stringio
    </a>
</li>
<li class="tag-4">
    <a href="/tag/python27/">
        <i class="icon-tag icon-large"></i>python27
    </a>
</li>
<li class="tag-3">
    <a href="/tag/list/">
        <i class="icon-tag icon-large"></i>list
    </a>
</li>
<li class="tag-4">
    <a href="/tag/dian-zi-shu/">
        <i class="icon-tag icon-large"></i>电子书
    </a>
</li>
<li class="tag-4">
    <a href="/tag/yield/">
        <i class="icon-tag icon-large"></i>yield
    </a>
</li>
<li class="tag-4">
    <a href="/tag/ming-ming-kong-jian/">
        <i class="icon-tag icon-large"></i>命名空间
    </a>
</li>
<li class="tag-4">
    <a href="/tag/jie-huo/">
        <i class="icon-tag icon-large"></i>解惑
    </a>
</li>
<li class="tag-4">
    <a href="/tag/rename/">
        <i class="icon-tag icon-large"></i>rename
    </a>
</li>
<li class="tag-4">
    <a href="/tag/djang-blog/">
        <i class="icon-tag icon-large"></i>djang-blog
    </a>
</li>
<li class="tag-4">
    <a href="/tag/fudge/">
        <i class="icon-tag icon-large"></i>fudge
    </a>
</li>
<li class="tag-4">
    <a href="/tag/intern/">
        <i class="icon-tag icon-large"></i>intern
    </a>
</li>
<li class="tag-4">
    <a href="/tag/equals-identical/">
        <i class="icon-tag icon-large"></i>equals-identical
    </a>
</li>
<li class="tag-3">
    <a href="/tag/python3/">
        <i class="icon-tag icon-large"></i>python3
    </a>
</li>
<li class="tag-4">
    <a href="/tag/metaclass/">
        <i class="icon-tag icon-large"></i>metaclass
    </a>
</li>
<li class="tag-4">
    <a href="/tag/ci-yun/">
        <i class="icon-tag icon-large"></i>词云
    </a>
</li>
<li class="tag-4">
    <a href="/tag/luan-ma/">
        <i class="icon-tag icon-large"></i>乱码
    </a>
</li>
<li class="tag-4">
    <a href="/tag/lsof/">
        <i class="icon-tag icon-large"></i>lsof
    </a>
</li>
<li class="tag-4">
    <a href="/tag/lambda/">
        <i class="icon-tag icon-large"></i>lambda
    </a>
</li>
<li class="tag-4">
    <a href="/tag/virtualenv/">
        <i class="icon-tag icon-large"></i>virtualenv
    </a>
</li>
<li class="tag-3">
    <a href="/tag/pythonic/">
        <i class="icon-tag icon-large"></i>pythonic
    </a>
</li>
<li class="tag-4">
    <a href="/tag/datetime/">
        <i class="icon-tag icon-large"></i>datetime
    </a>
</li>
<li class="tag-4">
    <a href="/tag/biao-qian-yun/">
        <i class="icon-tag icon-large"></i>标签云
    </a>
</li>
<li class="tag-4">
    <a href="/tag/tornado/">
        <i class="icon-tag icon-large"></i>tornado
    </a>
</li>
<li class="tag-4">
    <a href="/tag/cai-dan/">
        <i class="icon-tag icon-large"></i>彩蛋
    </a>
</li>
<li class="tag-2">
    <a href="/tag/linux/">
        <i class="icon-tag icon-large"></i>linux
    </a>
</li>


</ul>        </div><!--/.well -->

      </div><!--/row-->

      <hr>

      <footer>
        <!--<address id="about">
                Proudly powered by <a href="http://pelican.notmyidea.org/">Pelican <i class="icon-external-link"></i></a>,
                                which takes great advantage of <a href="http://python.org">Python <i class="icon-external-link"></i></a>.
        </address>--><!-- /#about -->

       <!-- <p>The theme is from <a href="http://twitter.github.com/bootstrap/">Bootstrap from Twitter <i class="icon-external-link"></i></a>,
                   and <a href="http://fortawesome.github.com/Font-Awesome/">Font-Awesome <i class="icon-external-link"></i></a>, thanks!</p>-->
         <p>&copy; 2018 By Alex</p>
      </footer>

    </div><!--/.fluid-container-->



    <!-- Le javascript -->
    <!-- Placed at the end of the document so the pages load faster -->
    <script src="/theme/js/jquery-1.7.2.min.js"></script>
    <script src="/theme/js/bootstrap.min.js"></script>
  </body>
</html>