<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>12步教你理解Python装饰器</title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="">
    <meta name="author" content="Alex">

    <!-- Le styles -->
    <link rel="stylesheet" href="/theme/css/bootstrap.min.css" type="text/css" />
    <link rel="stylesheet" href="/theme/css/nest.css" type="text/css" />
    <link rel="stylesheet" href="/theme/css/fonts.css" type="text/css" />
    <style type="text/css">
      body {
        padding-top: 60px;
        padding-bottom: 40px;
      }
      .sidebar-nav {
        padding: 9px 0;
      }
      .tag-1 {
        font-size: 13pt;
      }
      .tag-2 {
        font-size: 10pt;
      }
      .tag-2 {
        font-size: 8pt;
      }
      .tag-4 {
        font-size: 6pt;
     }
    </style>
    <link href="/theme/css/bootstrap-responsive.min.css" rel="stylesheet">
        <link href="/theme/css/font-awesome.css" rel="stylesheet">

    <link href="/theme/css/pygments.css" rel="stylesheet">

    <!--<link href="/theme/css/base.css" rel="stylesheet">-->

    <script src="/theme/js/jquery-1.7.2.min.js"></script>



    <!-- Le HTML5 shim, for IE6-8 support of HTML5 elements -->
    <!--[if lt IE 9]>
      <script src="//html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <!-- Le fav and touch icons -->
    <link rel="shortcut icon" href="/theme/images/favicon.ico">
    <link rel="apple-touch-icon" href="/theme/images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="/theme/images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="/theme/images/apple-touch-icon-114x114.png">

    <link href="/" type="application/atom+xml" rel="alternate" title="Alex's Blog ATOM Feed" />

  </head>

  <body>

    <div class="navbar navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container-fluid">
          <a class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse">
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </a>
          <a class="brand" href="/index.html">Alex's Blog </a>
          <div class="nav-collapse">
            <ul class="nav">
                          <li class="divider-vertical"></li>
                  <li >
                    <a href="/category/code-example/index.html">
						<i class="icon-folder-open icon-large"></i>Code Example
					</a>
                  </li>
                  <li >
                    <a href="/category/linux/index.html">
						<i class="icon-folder-open icon-large"></i>Linux
					</a>
                  </li>
                  <li >
                    <a href="/category/pa-chong-ji-zhu/index.html">
						<i class="icon-folder-open icon-large"></i>爬虫技术
					</a>
                  </li>
                  <li class="active">
                    <a href="/category/pythonji-zhu/index.html">
						<i class="icon-folder-open icon-large"></i>Python技术
					</a>
                  </li>
                              <!--<li ><a href="/categories.html"><i class="icon-folder-close icon-large"></i>Categories</a></li>-->
                                <li><a href="/tags.html"><i class="icon-tags icon-large"></i>Tags</a></li>
                          <ul class="nav pull-right">

                                <li><a href="/archives.html"><i class="icon-th-list"></i>文章列表</a></li>
                          </ul>

            </ul>
            <!--<p class="navbar-text pull-right">Logged in as <a href="#">username</a></p>-->
          </div><!--/.nav-collapse -->
        </div>
      </div>
    </div>

    <div class="container-fluid">
      <div class="row">
        <div class="span9" id="content">
<section id="content">
        <article>
                <header>
                        <h1>
                                <a href=""
                                        rel="bookmark"
                                        title="Permalink to 12步教你理解Python装饰器">
                                        12步教你理解Python装饰器
                                </a>
                        </h1>
                </header>
                <div class="entry-content">
                <div class="well">
<footer class="post-info">
<span class="label">Date</span>
<abbr class="published" title="2016-02-24T00:00:00+08:00">
        <i class="icon-calendar"></i>Wed 24 February 2016
</abbr>
<span class="label">By</span>
<a href="/author/alex/"><i class="icon-user"></i>Alex</a>
<span class="label">Category</span>
<a href="/category/pythonji-zhu/index.html"><i class="icon-folder-open"></i>Python技术</a>.


<span class="label">Tags</span>
	<a href="/tag/bi-bao/index.html"><i class="icon-tag"></i>闭包</a>
	<a href="/tag/decorator/index.html"><i class="icon-tag"></i>decorator</a>
	<a href="/tag/zhuang-shi-qi/index.html"><i class="icon-tag"></i>装饰器</a>

</footer><!-- /.post-info -->                </div>
                <article>
        <p>&#25110;&#35768;&#20320;&#24050;&#32463;&#29992;&#36807;&#35013;&#39280;&#22120;&#65292;&#23427;&#30340;&#20351;&#29992;&#26041;&#24335;&#38750;&#24120;&#31616;&#21333;&#20294;&#29702;&#35299;&#36215;&#26469;&#22256;&#38590;&#65288;&#20854;&#23454;&#30495;&#27491;&#29702;&#35299;&#30340;&#20063;&#24456;&#31616;&#21333;&#65289;&#65292;&#24819;&#35201;&#29702;&#35299;&#35013;&#39280;&#22120;&#65292;&#20320;&#38656;&#35201;&#25026;&#28857;&#20989;&#25968;&#24335;&#32534;&#31243;&#30340;&#27010;&#24565;&#65292;python&#20989;&#25968;&#30340;&#23450;&#20041;&#20197;&#21450;&#20989;&#25968;&#35843;&#29992;&#30340;&#35821;&#27861;&#35268;&#21017;&#31561;&#65292;&#34429;&#28982;&#25105;&#27809;&#27861;&#25226;&#35013;&#39280;&#22120;&#21464;&#24471;&#31616;&#21333;&#65292;&#20294;&#26159;&#25105;&#24076;&#26395;&#21487;&#20197;&#36890;&#36807;&#19979;&#38754;&#30340;&#27493;&#39588;&#35753;&#20320;&#30001;&#27973;&#20837;&#28145;&#26126;&#30333;&#35013;&#39280;&#22120;&#26159;&#20160;&#20040;&#12290;&#20551;&#23450;&#20320;&#25317;&#26377;&#26368;&#22522;&#26412;&#30340;Python&#30693;&#35782;&#65292;&#26412;&#25991;&#38416;&#36848;&#30340;&#19996;&#35199;&#21487;&#33021;&#23545;&#37027;&#20123;&#22312;&#24037;&#20316;&#20013;&#32463;&#24120;&#25509;&#35302;Python&#30340;&#20154;&#26377;&#24456;&#22823;&#30340;&#24110;&#21161;&#12290;</p>
<h3>1&#12289;&#20989;&#25968;&#65288;Functions&#65289;</h3>
<p>&#22312;Python&#37324;&#65292;&#20989;&#25968;&#26159;&#29992;def&#20851;&#38190;&#23383;&#21518;&#36319;&#19968;&#20010;&#20989;&#25968;&#21517;&#31216;&#21644;&#19968;&#20010;&#21487;&#36873;&#30340;&#21442;&#25968;&#34920;&#21015;&#26469;&#21019;&#24314;&#30340;&#65292;&#21487;&#20197;&#29992;&#20851;&#38190;&#23383;return&#25351;&#23450;&#36820;&#22238;&#20540;&#12290;&#19979;&#38754;&#35753;&#25105;&#20204;&#21019;&#24314;&#21644;&#35843;&#29992;&#19968;&#20010;&#26368;&#31616;&#21333;&#30340;&#20989;&#25968;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def foo():
...     return 1
&gt;&gt;&gt; foo()
1
</pre></div>

<p>&#35813;&#20989;&#25968;&#30340;&#20989;&#25968;&#20307;&#65288;&#22312;Python&#37324;&#23558;&#23601;&#26159;&#22810;&#34892;&#35821;&#21477;&#65289;&#26159;&#24378;&#21046;&#24615;&#30340;&#24182;&#19988;&#36890;&#36807;&#32553;&#36827;&#26469;&#34920;&#26126;&#12290;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;&#22312;&#20989;&#25968;&#21517;&#21518;&#38754;&#28155;&#21152;&#21452;&#25324;&#21495;&#26469;&#35843;&#29992;&#20989;&#25968;&#12290;</p>
<h3>2&#12289;&#20316;&#29992;&#22495;&#65288;Scope&#65289;</h3>
<p>&#22312;Python&#20013;&#65292;&#27599;&#20010;&#20989;&#25968;&#37117;&#20250;&#21019;&#24314;&#19968;&#20010;&#20316;&#29992;&#22495;&#12290;Pythonistas&#20063;&#21487;&#33021;&#31216;&#20989;&#25968;&#25317;&#26377;&#23427;&#20204;&#33258;&#24049;&#30340;&#21629;&#21517;&#31354;&#38388;&#65288;namespace&#65289;&#12290;&#36825;&#24847;&#21619;&#30528;&#24403;&#22312;&#20989;&#25968;&#20307;&#37324;&#36935;&#21040;&#21464;&#37327;&#21517;&#26102;&#65292;Python&#39318;&#20808;&#22312;&#35813;&#20989;&#25968;&#30340;&#21629;&#21517;&#31354;&#38388;&#20013;&#26597;&#25214;&#65292;Python&#21253;&#21547;&#20102;&#19968;&#20123;&#35753;&#25105;&#20204;&#26597;&#30475;&#21629;&#21517;&#31354;&#38388;&#30340;&#20989;&#25968;&#12290;&#35753;&#25105;&#20204;&#20889;&#19968;&#20010;&#31616;&#21333;&#30340;&#20989;&#25968;&#26469;&#25506;&#26597;&#19968;&#19979;local&#21644;global&#20316;&#29992;&#22495;&#30340;&#21306;&#21035;&#12290;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; a_string = "This is a global variable"
&gt;&gt;&gt; def foo():
...     print locals()
&gt;&gt;&gt; print globals() # doctest: +ELLIPSIS
{..., 'a_strin': 'This ia a global variable'}
&gt;&gt;&gt; foo() # 2
{}
</pre></div>


<p>&#20869;&#24314;&#30340;globals&#20989;&#25968;&#36820;&#22238;&#19968;&#20010;&#23383;&#20856;&#23545;&#35937;&#65292;&#23427;&#21253;&#21547;&#25152;&#26377;Python&#30693;&#36947;&#30340;&#21464;&#37327;&#21517;(&#20026;&#20102;&#28165;&#26970;&#26126;&#20102;&#36215;&#35265;&#65292;&#25105;&#24050;&#32463;&#24573;&#30053;&#20102;&#19968;&#20123;Python&#33258;&#21160;&#21019;&#24314;&#30340;&#21464;&#37327;)&#12290;&#22312;#2&#22788;&#25105;&#35843;&#29992;&#20102;&#20989;&#25968;foo&#65292;&#23427;&#23558;&#20989;&#25968;&#20869;&#37096;&#30340;local namespace&#37324;&#30340;&#20869;&#23481;&#25171;&#21360;&#20102;&#20986;&#26469;&#12290;&#27491;&#22914;&#25105;&#20204;&#30475;&#21040;&#30340;foo&#20989;&#25968;&#25317;&#26377;&#33258;&#24049;&#30340;&#29420;&#31435;namespace&#65292;&#29616;&#22312;&#23427;&#36824;&#26159;&#31354;&#30340;&#12290;</p>
<h3>3&#12289;&#21464;&#37327;&#35299;&#26512;&#35268;&#21017;&#65288;variable resolution rules&#65289;</h3>
<p>&#24403;&#28982;&#65292;&#36825;&#24182;&#19981;&#24847;&#21619;&#30528;&#22312;&#20989;&#25968;&#20869;&#37096;&#25105;&#20204;&#19981;&#33021;&#35775;&#38382;&#20840;&#23616;&#21464;&#37327;&#12290;Python&#30340;&#20316;&#29992;&#22495;&#35268;&#21017;&#26159;&#65292;&#21464;&#37327;&#30340;&#21019;&#24314;&#24635;&#20250;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;local&#21464;&#37327;&#65292;&#20294;&#26159;&#21464;&#37327;&#30340;&#35775;&#38382;&#65288;&#21253;&#25324;&#20462;&#25913;&#65289;&#20250;&#20808;&#26597;&#25214;local&#20316;&#29992;&#22495;&#28982;&#21518;&#39034;&#30528;&#26368;&#37051;&#36817;&#30340;&#20316;&#29992;&#22495;&#21435;&#23547;&#25214;&#21305;&#37197;&#12290;&#22240;&#27492;&#65292;&#22914;&#26524;&#25105;&#20204;&#20462;&#25913;foo&#20989;&#25968;&#26469;&#35753;&#23427;&#25171;&#21360;global&#21464;&#37327;&#65292;&#32467;&#26524;&#23601;&#20250;&#20687;&#25105;&#20204;&#24076;&#26395;&#30340;&#37027;&#26679;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; a_string = "This is global variable"
&gt;&gt;&gt; def foo():
...     print a_string # 1
&gt;&gt;&gt; foo()
This is a global variable
</pre></div>


<p>&#22312;#1&#22788;&#65292;Python&#22312;&#20989;&#25968;&#20013;&#23547;&#25214;&#19968;&#20010;local&#21464;&#37327;&#65292;&#20294;&#26159;&#27809;&#26377;&#25214;&#21040;&#65292;&#28982;&#21518;&#22312;global&#21464;&#37327;&#20013;&#25214;&#21040;&#20102;&#19968;&#20010;&#21516;&#21517;&#30340;&#21464;&#37327;&#12290;</p>
<p>&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#25105;&#20204;&#23581;&#35797;&#22312;&#20989;&#25968;&#37324;&#32473;global&#21464;&#37327;&#36171;&#20540;&#65292;&#32467;&#26524;&#23558;&#19981;&#22914;&#25105;&#20204;&#25152;&#24895;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; a_string = 'This is a global variable"
&gt;&gt;&gt; def foo():
...     a_string = "test" # 1
...        print locals()
&gt;&gt;&gt; foo()
{'a_string': 'test'}
&gt;&gt;&gt; a_string # 2
'This is a global variable'
</pre></div>


<p>&#27491;&#22914;&#25105;&#20204;&#25152;&#35265;&#65292;&#20840;&#23616;&#21464;&#37327;&#21487;&#20197;&#34987;&#35775;&#38382;&#21040;&#65288;&#22914;&#26524;&#26159;&#21487;&#21464;&#31867;&#22411;&#65292;&#20854;&#29978;&#33267;&#21487;&#20197;&#34987;&#25913;&#21464;&#65289;&#65292;&#20294;&#26159;&#65288;&#40664;&#35748;&#24773;&#20917;&#19979;&#65289;&#19981;&#33021;&#34987;&#36171;&#20540;&#12290;&#22312;&#20989;&#25968;&#20869;&#37096;&#30340;#1&#22788;&#25105;&#20204;&#23454;&#38469;&#19978;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;local&#21464;&#37327;&#65292;&#23427;&#21644;&#20840;&#23616;&#21464;&#37327;&#25317;&#26377;&#30456;&#21516;&#30340;&#21517;&#23383;&#65292;&#23427;&#23558;&#20840;&#23616;&#21464;&#37327;&#32473;&#35206;&#30422;&#20102;&#12290;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;&#22312;foo&#20989;&#25968;&#20869;&#37096;&#25171;&#21360;local namespace&#26469;&#21457;&#29616;&#21040;&#23427;&#24050;&#32463;&#26377;&#20102;&#19968;&#20010;&#26465;&#30446;&#65292;&#36890;&#36807;&#23545;&#20989;&#25968;&#22806;&#37096;&#30340;#2&#22788;&#30340;&#36755;&#20986;&#32467;&#26524;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#65292;&#21464;&#37327;a_string&#30340;&#20540;&#26681;&#26412;&#23601;&#27809;&#26377;&#34987;&#25913;&#21464;&#12290;</p>
<h3>4&#12289;&#21464;&#37327;&#30340;&#29983;&#21629;&#21608;&#26399;&#65288;Variable lifetime&#65289;</h3>
<p>&#20063;&#35201;&#27880;&#24847;&#21040;&#65292;&#21464;&#37327;&#19981;&#20165;&#8220;&#29983;&#27963;&#22312;&#8221;&#19968;&#20010;&#21629;&#21517;&#31354;&#38388;&#37324;&#65292;&#23427;&#20204;&#36824;&#26377;&#29983;&#21629;&#21608;&#26399;&#12290;&#32771;&#34385;&#19979;&#38754;&#30340;&#20195;&#30721;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def foo():
...     x = 1
&gt;&gt;&gt; foo()
&gt;&gt;&gt; print x # 1
Traceback (most recent call last):
...
NameError: name 'x' is not defined
</pre></div>


<p>&#22312;#1&#22788;&#19981;&#20165;&#22240;&#20026;&#20316;&#29992;&#22495;&#35268;&#21017;&#24341;&#21457;&#20102;&#38382;&#39064;&#65288;&#23613;&#31649;&#36825;&#26159;&#20986;&#29616;&#20102;NameError&#30340;&#21407;&#22240;&#65289;&#65292;&#32780;&#19988;&#20063;&#20986;&#20110;&#22312;Python&#21644;&#35768;&#22810;&#20854;&#23427;&#35821;&#35328;&#37324;&#30340;&#20989;&#25968;&#35843;&#29992;&#23454;&#29616;&#30340;&#21407;&#22240;&#12290;&#27492;&#22788;&#65292;&#25105;&#20204;&#27809;&#26377;&#20219;&#20309;&#21487;&#29992;&#30340;&#35821;&#27861;&#26469;&#33719;&#21462;&#21464;&#37327;x&#30340;&#20540;&#8212;&#8212;&#23383;&#38754;&#19978;&#26159;&#19981;&#23384;&#22312;&#30340;&#12290;&#27599;&#27425;&#24403;&#35843;&#29992;foo&#20989;&#25968;&#26102;&#65292;&#23427;&#30340;namespace&#34987;&#37325;&#26032;&#26500;&#24314;&#65292;&#24182;&#19988;&#24403;&#20989;&#25968;&#32467;&#26463;&#26102;&#34987;&#38144;&#27585;&#12290;</p>
<h3>5&#12289;&#20989;&#25968;&#30340;&#21442;&#25968;&#65288;Function parameters&#65289;</h3>
<p>Python&#20801;&#35768;&#25105;&#20204;&#21521;&#20989;&#25968;&#20256;&#36882;&#21442;&#25968;&#12290;&#21442;&#25968;&#21517;&#25104;&#20026;&#20102;&#35813;&#20989;&#25968;&#30340;local&#21464;&#37327;&#12290;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def foo(x):
...        print locals()
&gt;&gt;&gt; foo(1)
{'x': 1}
</pre></div>


<p>Python&#26377;&#35768;&#22810;&#19981;&#21516;&#30340;&#23450;&#20041;&#21644;&#20256;&#36882;&#20989;&#25968;&#21442;&#25968;&#30340;&#26041;&#27861;&#12290;&#35201;&#24819;&#26356;&#35814;&#32454;&#28145;&#20837;&#22320;&#20102;&#35299;&#35831;&#21442;&#29031;<a href="http://docs.python.org/tutorial/controlflow.html#more-on-defining-functions">the Python documentation on defining functions</a>&#12290;&#36825;&#37324;&#25105;&#23637;&#31034;&#19968;&#20010;&#31616;&#29256;&#65306;&#20989;&#25968;&#21442;&#25968;&#26082;&#21487;&#20197;&#26159;&#24378;&#21046;&#30340;&#20301;&#32622;&#21442;&#25968;(positional parameters)&#25110;&#32773;&#26159;&#21629;&#21517;&#21442;&#25968;&#65292;&#21442;&#25968;&#30340;&#40664;&#35748;&#20540;&#26159;&#21487;&#36873;&#30340;&#12290;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def foo(x, y=0): # 1
...     return x - y
&gt;&gt;&gt; foo(3, 1) # 2
2
&gt;&gt;&gt; foo(3) # 3
3
&gt;&gt;&gt; foo() # 4
Traceback (most recent call last):
...
TypeError: foo() takes at least 1 argument (0 given)
&gt;&gt;&gt; foo(y=1, x=3) # 5
2
</pre></div>


<p>&#22312;#1&#22788;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#24102;&#26377;&#19968;&#20010;&#20301;&#32622;&#21442;&#25968;x&#21644;&#19968;&#20010;&#21629;&#21517;&#21442;&#25968;y&#30340;&#20989;&#25968;&#12290;&#27491;&#22914;&#25105;&#20204;&#30475;&#21040;&#30340;&#65292;&#22312;#2&#22788;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;&#26222;&#36890;&#30340;&#20540;&#20256;&#36882;&#26469;&#35843;&#29992;&#20989;&#25968;&#65292;&#21363;&#20351;&#19968;&#20010;&#21442;&#25968;(&#35793;&#32773;&#27880;&#65306;&#36825;&#37324;&#25351;&#21442;&#25968;y&#65289;&#22312;&#20989;&#25968;&#23450;&#20041;&#37324;&#34987;&#23450;&#20041;&#20026;&#19968;&#20010;&#21629;&#21517;&#21442;&#25968;&#12290;&#22312;#3&#22788;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#65292;&#25105;&#20204;&#29978;&#33267;&#21487;&#20197;&#19981;&#20026;&#21629;&#21517;&#21442;&#25968;&#20256;&#36882;&#20219;&#20309;&#20540;&#23601;&#21487;&#20197;&#35843;&#29992;&#20989;&#25968;&#8212;&#8212;&#22914;&#26524;foo&#20989;&#25968;&#27809;&#26377;&#25509;&#25910;&#21040;&#20256;&#32473;&#21629;&#21517;&#21442;&#25968;y&#30340;&#20540;&#65292;Python&#23558;&#20250;&#29992;&#25105;&#20204;&#22768;&#26126;&#30340;&#40664;&#35748;&#20540;0&#26469;&#35843;&#29992;&#20989;&#25968;&#12290;&#24403;&#28982;&#65292;&#25105;&#20204;&#19981;&#33021;&#28431;&#25481;&#31532;&#19968;&#20010;&#65288;&#24378;&#21046;&#30340;&#65292;&#23450;&#22909;&#20301;&#32622;&#30340;&#65289;&#21442;&#25968;&#8212;&#8212;#4&#20197;&#19968;&#20010;&#24322;&#24120;&#25551;&#36848;&#20102;&#36825;&#31181;&#38169;&#35823;&#12290;</p>
<p>&#37117;&#24456;&#28165;&#26224;&#21644;&#30452;&#25509;&#65292;&#19981;&#26159;&#21527;&#65311;&#19979;&#38754;&#21464;&#24471;&#26377;&#28857;&#20799;&#35753;&#20154;&#30097;&#24785;&#8212;&#8212;Python&#20063;&#25903;&#25345;&#20989;&#25968;&#35843;&#29992;&#26102;&#30340;&#21629;&#21517;&#21442;&#25968;&#32780;&#19981;&#21482;&#26159;&#22312;&#20989;&#25968;&#23450;&#20041;&#26102;&#12290;&#35831;&#30475;#5&#22788;&#65292;&#36825;&#37324;&#25105;&#20204;&#29992;&#20004;&#20010;&#21629;&#21517;&#21442;&#25968;&#35843;&#29992;&#20989;&#25968;&#65292;&#23613;&#31649;&#36825;&#20010;&#20989;&#25968;&#26159;&#20197;&#19968;&#20010;&#21629;&#21517;&#21644;&#19968;&#20010;&#20301;&#32622;&#21442;&#25968;&#26469;&#23450;&#20041;&#30340;&#12290;&#22240;&#20026;&#25105;&#20204;&#30340;&#21442;&#25968;&#26377;&#21517;&#23383;&#65292;&#25152;&#20197;&#25105;&#20204;&#20256;&#36882;&#30340;&#21442;&#25968;&#30340;&#20301;&#32622;&#19981;&#20250;&#20135;&#29983;&#20219;&#20309;&#24433;&#21709;&#12290; &#30456;&#21453;&#30340;&#24773;&#24418;&#24403;&#28982;&#20063;&#26159;&#27491;&#30830;&#30340;&#12290;&#25105;&#20204;&#30340;&#20989;&#25968;&#30340;&#19968;&#20010;&#21442;&#25968;&#34987;&#23450;&#20041;&#20026;&#19968;&#20010;&#21629;&#21517;&#21442;&#25968;&#20294;&#26159;&#25105;&#20204;&#36890;&#36807;&#20301;&#32622;&#20256;&#36882;&#21442;&#25968;&#8212;&#8212; #4&#22788;&#30340;&#35843;&#29992;foo(3, 1)&#23558;&#19968;&#20010;3&#20316;&#20026;&#31532;&#19968;&#20010;&#21442;&#25968;&#20256;&#36882;&#32473;&#25105;&#20204;&#25490;&#22909;&#24207;&#30340;&#21442;&#25968;x&#24182;&#23558;&#31532;&#20108;&#20010;&#21442;&#25968;&#65288;&#25972;&#25968;1&#65289;&#20256;&#36882;&#32473;&#31532;&#20108;&#20010;&#21442;&#25968;&#65292;&#23613;&#31649;&#23427;&#34987;&#23450;&#20041;&#20026;&#19968;&#20010;&#21629;&#21517;&#21442;&#25968;&#12290;</p>
<p>Whoo!&#36825;&#23601;&#20687;&#29992;&#24456;&#22810;&#35805;&#26469;&#25551;&#36848;&#19968;&#20010;&#38750;&#24120;&#31616;&#21333;&#30340;&#27010;&#24565;&#65306;&#20989;&#25968;&#30340;&#21442;&#25968;&#21487;&#20197;&#26377;&#21517;&#31216;&#25110;&#32773;&#20301;&#32622;&#12290;</p>
<h3>6&#12289;&#20869;&#23884;&#20989;&#25968;&#65288;Nested functions&#65289;</h3>
<p>Python&#20801;&#35768;&#21019;&#24314;&#23884;&#22871;&#20989;&#25968;&#65292;&#36825;&#24847;&#21619;&#30528;&#25105;&#20204;&#21487;&#20197;&#22312;&#20989;&#25968;&#20869;&#22768;&#26126;&#20989;&#25968;&#24182;&#19988;&#25152;&#26377;&#30340;&#20316;&#29992;&#22495;&#21644;&#22768;&#26126;&#21608;&#26399;&#35268;&#21017;&#20063;&#21516;&#26679;&#36866;&#29992;&#12290;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def outer():
...     x = 1
...     def inner():
...         print x # 1
...     inner() # 2
...
&gt;&gt;&gt; outer()
1
</pre></div>


<p>&#36825;&#30475;&#36215;&#26469;&#31245;&#26174;&#22797;&#26434;&#65292;&#20294;&#20854;&#34892;&#20026;&#20173;&#30456;&#24403;&#30452;&#25509;&#65292;&#26131;&#20110;&#29702;&#35299;&#12290;&#32771;&#34385;&#19968;&#19979;&#22312;#1&#22788;&#21457;&#29983;&#20102;&#20160;&#20040;&#8212;&#8212;Python&#23547;&#25214;&#19968;&#20010;&#21517;&#20026;x&#30340;local&#21464;&#37327;&#65292;&#22833;&#36133;&#20102;&#65292;&#28982;&#21518;&#22312;&#26368;&#37051;&#36817;&#30340;&#22806;&#23618;&#20316;&#29992;&#22495;&#37324;&#25628;&#23547;&#65292;&#36825;&#20010;&#20316;&#29992;&#22495;&#26159;&#21478;&#19968;&#20010;&#20989;&#25968;&#65281;&#21464;&#37327;x&#26159;&#20989;&#25968;outer&#30340;local&#21464;&#37327;&#65292;&#20294;&#26159;&#21644;&#21069;&#25991;&#25552;&#21040;&#30340;&#19968;&#26679;&#65292;inner&#20989;&#25968;&#25317;&#26377;&#23545;&#22806;&#23618;&#20316;&#29992;&#22495;&#30340;&#35775;&#38382;&#26435;&#38480;&#65288;&#26368;&#36215;&#30721;&#26377;&#35835;&#21644;&#20462;&#25913;&#30340;&#26435;&#38480;&#65289;&#12290;&#22312;#2&#22788;&#25105;&#20204;&#35843;&#29992;&#20102;inner&#20989;&#25968;&#12290;&#35831;&#35760;&#20303;inner&#20063;&#21482;&#26159;&#19968;&#20010;&#21464;&#37327;&#21517;&#65292;&#23427;&#20063;&#36981;&#20174;Python&#30340;&#21464;&#37327;&#26597;&#25214;&#35268;&#21017;&#8212;&#8212;Python&#39318;&#20808;&#22312;outer&#30340;&#20316;&#29992;&#22495;&#37324;&#26597;&#25214;&#20043;&#65292;&#25214;&#21040;&#20102;&#19968;&#20010;&#21517;&#20026;inner&#30340;local&#21464;&#37327;&#12290;</p>
<h3>7&#12289;&#20989;&#25968;&#26159;&#19968;&#31561;&#20844;&#27665;&#65288;Functions are first class objects in Python&#65289;</h3>
<p>&#22312;Python&#20013;&#65292;&#36825;&#26159;&#19968;&#20010;&#24120;&#35782;&#65292;&#20989;&#25968;&#26159;&#21644;&#20854;&#23427;&#20219;&#20309;&#19996;&#35199;&#19968;&#26679;&#30340;&#23545;&#35937;&#12290;&#21571;&#65292;&#20989;&#25968;&#21253;&#21547;&#21464;&#37327;&#65292;&#23427;&#19981;&#26159;&#37027;&#20040;&#30340;&#29305;&#27530;&#65281;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; issubclass(int, object) # all objects in Python inherit from a common baseclass
True
&gt;&gt;&gt; def foo():
...     pass
&gt;&gt;&gt; foo.__class__ # 1&gt;&gt;&gt; issubclass(foo.__class__, object)
True
</pre></div>


<p>&#20320;&#20063;&#35768;&#20174;&#27809;&#24819;&#21040;&#36807;&#20989;&#25968;&#20063;&#26377;&#23646;&#24615;&#65292;&#20294;&#26159;&#22312;Python&#20013;&#65292;&#21644;&#20854;&#23427;&#20219;&#20309;&#19996;&#35199;&#19968;&#26679;&#65292;&#20989;&#25968;&#26159;&#23545;&#35937;&#12290;&#65288;&#22914;&#26524;&#20320;&#21457;&#35273;&#36825;&#20196;&#20320;&#24863;&#21040;&#22256;&#24785;&#65292;&#35831;&#31561;&#19968;&#19979;&#65292;&#30693;&#36947;&#20320;&#20102;&#35299;&#21040;&#22312;Python&#20013;&#20687;&#20854;&#23427;&#20219;&#20309;&#19996;&#35199;&#19968;&#26679;&#65292;class&#20063;&#26159;&#23545;&#35937;&#65281;&#65289;&#20063;&#35768;&#27491;&#26159;&#22240;&#20026;&#36825;&#19968;&#28857;&#20351;Python&#22810;&#23569;&#26377;&#28857;&#8220;&#23398;&#26415;&#8221;&#30340;&#24847;&#21619;&#8212;&#8212;&#22312;Python&#20013;&#20687;&#20854;&#23427;&#20219;&#20309;&#20540;&#19968;&#26679;&#21482;&#26159;&#24120;&#35268;&#30340;&#20540;&#32780;&#24050;&#12290;&#36825;&#24847;&#21619;&#30528;&#20320;&#21487;&#20197;&#23558;&#20989;&#25968;&#20316;&#20026;&#21442;&#25968;&#20256;&#36882;&#32473;&#20989;&#25968;&#25110;&#32773;&#22312;&#20989;&#25968;&#20013;&#23558;&#20989;&#25968;&#20316;&#20026;&#36820;&#22238;&#20540;&#36820;&#22238;&#65281;&#22914;&#26524;&#20320;&#20174;&#26410;&#32771;&#34385;&#36807;&#36825;&#31181;&#20107;&#24773;&#35831;&#32771;&#34385;&#19979;&#22914;&#19979;&#30340;&#21512;&#27861;Python&#20195;&#30721;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def add(x, y):
...     return x + y
&gt;&gt;&gt; def sub(x, y):
...     return x - y
&gt;&gt;&gt; def apply(func, x, y): # 1
...     return func(x, y) # 2
&gt;&gt;&gt; apply(add, 2, 1) # 3
3
&gt;&gt;&gt; apply(sub, 2, 1)
1
</pre></div>


<p>&#36825;&#20010;&#20363;&#23376;&#23545;&#20320;&#26469;&#35828;&#21487;&#33021;&#20063;&#19981;&#26159;&#22826;&#22855;&#24618;&#8212;&#8212;add&#21644;sub&#26159;&#26631;&#20934;&#30340;Python&#20989;&#25968;&#65292;&#23427;&#20204;&#37117;&#25509;&#21463;&#20004;&#20010;&#20540;&#24182;&#36820;&#22238;&#19968;&#20010;&#35745;&#31639;&#20102;&#30340;&#32467;&#26524;&#12290;&#22312;#1&#22788;&#20320;&#21487;&#20197;&#30475;&#21040;&#21464;&#37327;&#25509;&#21463;&#19968;&#20010;&#20989;&#25968;&#23601;&#20687;&#20854;&#23427;&#20219;&#20309;&#26222;&#36890;&#30340;&#21464;&#37327;&#12290;&#22312;#2&#22788;&#25105;&#20204;&#35843;&#29992;&#20256;&#20837;apply&#30340;&#20989;&#25968;&#8212;&#8212;&#22312;Python&#37324;&#21452;&#25324;&#21495;&#26159;&#35843;&#29992;&#25805;&#20316;&#31526;&#65292;&#24182;&#19988;&#35843;&#29992;&#21464;&#37327;&#21517;&#21253;&#21547;&#30340;&#20540;&#12290;&#22312;#3&#22788;&#20320;&#21487;&#20197;&#30475;&#20986;&#22312;Python&#20013;&#23558;&#20989;&#25968;&#24403;&#20570;&#20540;&#36827;&#34892;&#20256;&#36882;&#24182;&#27809;&#26377;&#20219;&#20309;&#29305;&#27530;&#35821;&#27861;&#8212;&#8212;&#20989;&#25968;&#21517;&#23601;&#20687;&#20219;&#20309;&#20854;&#23427;&#21464;&#37327;&#19968;&#26679;&#21482;&#26159;&#21464;&#37327;&#26631;&#31614;&#12290;</p>
<p>&#20320;&#20043;&#21069;&#21487;&#33021;&#35265;&#36807;&#36825;&#31181;&#34892;&#20026;&#8212;&#8212;Python&#23558;&#20989;&#25968;&#20316;&#20026;&#21442;&#25968;&#32463;&#24120;&#35265;&#20110;&#20687;&#36890;&#36807;&#20026;key&#21442;&#25968;&#25552;&#20379;&#19968;&#20010;&#20989;&#25968;&#26469;&#33258;&#23450;&#20041;sorted&#20869;&#24314;&#20989;&#25968;&#31561;&#25805;&#20316;&#20013;&#12290;&#20294;&#26159;&#65292;&#23558;&#20989;&#25968;&#20316;&#20026;&#36820;&#22238;&#20540;&#36820;&#22238;&#20250;&#24590;&#26679;&#21602;&#65311;&#35831;&#32771;&#34385;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def outer():
...     def inner():
...         print "Inside inner"
...     return inner # 1
...
&gt;&gt;&gt; foo = outer() #2
&gt;&gt;&gt; foo # doctest:+ELLIPSIS
&lt;function inner at 0x...&gt;
&gt;&gt;&gt; foo()
Inside inner
</pre></div>


<p>&#36825;&#20045;&#30475;&#36215;&#26469;&#26377;&#28857;&#22855;&#24618;&#12290;&#22312;#1&#22788;&#25105;&#36820;&#22238;&#20102;&#21464;&#37327;inner&#65292;&#23427;&#30896;&#24039;&#26159;&#19968;&#20010;&#20989;&#25968;&#26631;&#31614;&#12290;&#36825;&#37324;&#27809;&#26377;&#29305;&#27530;&#35821;&#27861;&#8212;&#8212;&#25105;&#20204;&#30340;&#20989;&#25968;&#36820;&#22238;&#20102;inner&#20989;&#25968;&#65288;&#35843;&#29992;outer()&#20989;&#25968;&#24182;&#19981;&#20135;&#29983;&#21487;&#35265;&#30340;&#25191;&#34892;&#65289;&#12290;&#36824;&#35760;&#24471;&#21464;&#37327;&#30340;&#29983;&#21629;&#21608;&#26399;&#21527;&#65311;&#27599;&#24403;outer&#20989;&#25968;&#34987;&#35843;&#29992;&#26102;inner&#20989;&#25968;&#23601;&#20250;&#37325;&#26032;&#34987;&#23450;&#20041;&#19968;&#27425;&#65292;&#20294;&#26159;&#22914;&#26524;inner&#20989;&#25968;&#19981;&#34987;(outer)&#36820;&#22238;&#37027;&#20040;&#24403;&#36229;&#20986;outer&#30340;&#20316;&#29992;&#22495;&#21518;&#65292;inner&#23558;&#19981;&#22797;&#23384;&#22312;&#20102;&#12290;</p>
<p>&#22312;#2&#22788;&#25105;&#20204;&#21487;&#20197;&#33719;&#21462;&#21040;&#36820;&#22238;&#20540;&#65292;&#23427;&#26159;&#25105;&#20204;&#30340;inner&#20989;&#25968;&#65292;&#23427;&#34987;&#23384;&#20648;&#20110;&#19968;&#20010;&#26032;&#30340;&#21464;&#37327;foo&#12290;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#65292;&#22914;&#26524;&#25105;&#20204;&#35745;&#31639;foo&#65292;&#23427;&#30495;&#30340;&#21253;&#21547;inner&#20989;&#25968;&#65292;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;&#20351;&#29992;&#35843;&#29992;&#36816;&#31639;&#31526;&#65288;&#21452;&#25324;&#21495;&#65292;&#36824;&#35760;&#24471;&#21527;&#65311;&#65289;&#26469;&#35843;&#29992;&#23427;&#12290;&#36825;&#30475;&#36215;&#26469;&#21487;&#33021;&#26377;&#28857;&#24618;&#24322;&#65292;&#20294;&#26159;&#21040;&#30446;&#21069;&#20026;&#27490;&#27809;&#26377;&#20160;&#20040;&#38590;&#20197;&#29702;&#35299;&#65292;&#19981;&#26159;&#20040;&#65311;&#25402;&#20303;&#65292;&#22240;&#20026;&#25509;&#19979;&#26469;&#30340;&#19996;&#35199;&#23558;&#20250;&#24456;&#24618;&#24322;&#12290;</p>
<h3>8&#12289;&#38381;&#21253;&#65288;Closures&#65289;</h3>
<p>&#35753;&#25105;&#20204;&#19981;&#20174;&#23450;&#20041;&#32780;&#26159;&#20174;&#21478;&#19968;&#20010;&#20195;&#30721;&#31034;&#20363;&#24320;&#22987;&#12290;&#22914;&#26524;&#25105;&#20204;&#23558;&#19978;&#19968;&#20010;&#20363;&#23376;&#31245;&#21152;&#20462;&#25913;&#20250;&#24590;&#26679;&#21602;&#65311;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def outer():
...     x = 1
...     def inner():
...         print x # 1
...     return inner
&gt;&gt;&gt; foo = outer()
&gt;&gt;&gt; foo.func_closure # doctest: +ELLIPSIS
(&lt;cell at 0x...: int object at 0x...&gt;,)
</pre></div>


<p>&#20174;&#19978;&#19968;&#20010;&#20363;&#23376;&#20013;&#25105;&#20204;&#30475;&#21040;inner&#26159;&#19968;&#20010;&#30001;outer&#36820;&#22238;&#30340;&#20989;&#25968;&#65292;&#23384;&#20648;&#20110;&#19968;&#20010;&#21517;&#20026;foo&#30340;&#21464;&#37327;&#65292;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;foo()&#35843;&#29992;&#23427;&#12290;&#20294;&#26159;&#23427;&#33021;&#36816;&#34892;&#21527;&#65311;&#35753;&#25105;&#20204;&#20808;&#26469;&#32771;&#34385;&#19968;&#19979;&#20316;&#29992;&#22495;&#35268;&#21017;&#12290;</p>
<p>&#19968;&#20999;&#37117;&#20381;&#29031;Python&#30340;&#20316;&#29992;&#22495;&#35268;&#21017;&#32780;&#36816;&#34892;&#8212;&#8212;x&#26159;outer&#20989;&#25968;&#20102;&#19968;&#20010;local&#21464;&#37327;&#12290;&#24403;inner&#22312;#1&#22788;&#25171;&#21360;x&#26102;&#65292;Python&#22312;inner&#20013;&#23547;&#25214;&#19968;&#20010;local&#21464;&#37327;&#65292;&#27809;&#26377;&#25214;&#21040;&#65307;&#28982;&#21518;&#23427;&#22312;&#22806;&#23618;&#20316;&#29992;&#22495;&#21363;outer&#20989;&#25968;&#20013;&#23547;&#25214;&#24182;&#25214;&#21040;&#20102;&#23427;&#12290;</p>
<p>&#20294;&#26159;&#33258;&#27492;&#22788;&#20174;&#21464;&#37327;&#29983;&#21629;&#21608;&#26399;&#30340;&#35282;&#24230;&#26469;&#30475;&#21448;&#20250;&#22914;&#20309;&#21602;&#65311;&#21464;&#37327;x&#26159;&#20989;&#25968;outer&#30340;local&#21464;&#37327;&#65292;&#36825;&#24847;&#21619;&#30528;&#21482;&#26377;&#24403;outer&#20989;&#25968;&#36816;&#34892;&#26102;&#23427;&#25165;&#23384;&#22312;&#12290;&#21482;&#26377;&#24403;outer&#36820;&#22238;&#21518;&#25105;&#20204;&#25165;&#33021;&#35843;&#29992;inner&#65292;&#22240;&#27492;&#20381;&#29031;&#25105;&#20204;&#20851;&#20110;Python&#22914;&#20309;&#36816;&#20316;&#30340;&#27169;&#22411;&#26469;&#30475;&#65292;&#22312;&#25105;&#20204;&#35843;&#29992;inner&#30340;&#26102;&#20505;x&#24050;&#32463;&#19981;&#22797;&#23384;&#22312;&#20102;&#65292;&#37027;&#20040;&#26576;&#20010;&#36816;&#34892;&#26102;&#38169;&#35823;&#21487;&#33021;&#20250;&#20986;&#29616;&#12290;</p>
<p>&#20107;&#23454;&#19982;&#25105;&#20204;&#30340;&#39044;&#24819;&#24182;&#19981;&#19968;&#33268;&#65292;&#36820;&#22238;&#30340;inner&#20989;&#25968;&#30340;&#30830;&#27491;&#24120;&#36816;&#34892;&#12290;Python&#25903;&#25345;&#19968;&#31181;&#31216;&#20026;&#38381;&#21253;(function closures)&#30340;&#29305;&#24615;&#65292;&#36825;&#24847;&#21619;&#30528;&#23450;&#20041;&#20110;&#38750;&#20840;&#23616;&#20316;&#29992;&#22495;&#30340;inner&#20989;&#25968;&#22312;&#23450;&#20041;&#26102;&#35760;&#24471;&#23427;&#20204;&#30340;&#22806;&#23618;&#20316;&#29992;&#22495;&#38271;&#20160;&#20040;&#26679;&#12290;&#36825;&#21487;&#20197;&#36890;&#36807;&#26597;&#30475;inner&#20989;&#25968;&#30340;func_closure&#23646;&#24615;&#26469;&#26597;&#30475;&#65292;&#23427;&#21253;&#21547;&#20102;&#22806;&#23618;&#20316;&#29992;&#22495;&#37324;&#30340;&#21464;&#37327;&#12290;</p>
<p>&#35831;&#35760;&#20303;&#65292;&#27599;&#27425;&#24403;outer&#20989;&#25968;&#34987;&#35843;&#29992;&#26102;inner&#20989;&#25968;&#37117;&#34987;&#37325;&#26032;&#23450;&#20041;&#19968;&#27425;&#12290;&#30446;&#21069;x&#30340;&#20540;&#27809;&#26377;&#25913;&#21464;&#65292;&#22240;&#27492;&#25105;&#20204;&#24471;&#21040;&#30340;&#27599;&#20010;inner&#20989;&#25968;&#21644;&#20854;&#23427;&#30340;inner&#20989;&#25968;&#25317;&#26377;&#30456;&#21516;&#30340;&#34892;&#20026;&#65292;&#20294;&#26159;&#22914;&#26524;&#25105;&#20204;&#23558;&#23427;&#20570;&#20986;&#19968;&#28857;&#25913;&#21464;&#21602;&#65311;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def outer(x):
...     def inner():
...         print x # 1
...        return inner
&gt;&gt;&gt; print1 = outer(1)
&gt;&gt;&gt; print2 = outer(2)
&gt;&gt;&gt; print1()
1
&gt;&gt;&gt; print2()
2
</pre></div>


<p>&#20174;&#36825;&#20010;&#20363;&#23376;&#20013;&#20320;&#21487;&#20197;&#30475;&#21040;closures&#8212;&#8212;&#20989;&#25968;&#35760;&#20303;&#20182;&#20204;&#30340;&#22806;&#23618;&#20316;&#29992;&#22495;&#30340;&#20107;&#23454;&#8212;&#8212;&#21487;&#20197;&#29992;&#26469;&#26500;&#24314;&#26412;&#36136;&#19978;&#26377;&#19968;&#20010;&#30828;&#32534;&#30721;&#21442;&#25968;&#30340;&#33258;&#23450;&#20041;&#20989;&#25968;&#12290;&#25105;&#20204;&#27809;&#26377;&#23558;&#25968;&#23383;1&#25110;&#32773;2&#20256;&#36882;&#32473;&#25105;&#20204;&#30340;inner&#20989;&#25968;&#20294;&#26159;&#26500;&#24314;&#20102;&#33021;"&#35760;&#20303;"&#20854;&#24212;&#35813;&#25171;&#21360;&#25968;&#23383;&#30340;&#33258;&#23450;&#20041;&#29256;&#26412;&#12290;</p>
<p>closures&#23601;&#26159;&#19968;&#20010;&#24378;&#26377;&#21147;&#30340;&#25216;&#26415;&#8212;&#8212;&#20320;&#29978;&#33267;&#24819;&#21040;&#22312;&#26576;&#20123;&#26041;&#38754;&#23427;&#26377;&#28857;&#31867;&#20284;&#20110;&#38754;&#21521;&#23545;&#35937;&#25216;&#26415;&#65306;outer&#26159;inner&#30340;&#26500;&#36896;&#20989;&#25968;&#65292;x&#25198;&#28436;&#30528;&#19968;&#20010;&#31867;&#20284;&#31169;&#26377;&#25104;&#21592;&#21464;&#37327;&#30340;&#35282;&#33394;&#12290;&#23427;&#30340;&#20316;&#29992;&#26377;&#24456;&#22810;&#65292;&#22914;&#26524;&#20320;&#29087;&#24713;Python&#30340;sorted&#20989;&#25968;&#30340;key&#21442;&#25968;&#65292;&#20320;&#21487;&#33021;&#24050;&#32463;&#20889;&#36807;&#19968;&#20010;lambda&#20989;&#25968;&#36890;&#36807;&#31532;&#20108;&#39033;&#32780;&#19981;&#26159;&#31532;&#19968;&#39033;&#26469;&#25490;&#24207;&#19968;&#20123;&#21015;list&#12290;&#20063;&#35768;&#20320;&#29616;&#22312;&#21487;&#20197;&#20889;&#19968;&#20010;itemgetter&#20989;&#25968;&#65292;&#23427;&#25509;&#25910;&#19968;&#20010;&#29992;&#20110;&#26816;&#32034;&#30340;&#32034;&#24341;&#24182;&#36820;&#22238;&#19968;&#20010;&#20989;&#25968;&#65292;&#36825;&#20010;&#20989;&#25968;&#36866;&#21512;&#20256;&#36882;&#32473;key&#21442;&#25968;&#12290;</p>
<p>&#20294;&#26159;&#35753;&#25105;&#20204;&#19981;&#35201;&#29992;&#38381;&#21253;&#20570;&#20219;&#20309;&#22121;&#26790;&#33324;&#30340;&#20107;&#24773;&#65281;&#30456;&#21453;&#65292;&#35753;&#25105;&#20204;&#37325;&#26032;&#20174;&#22836;&#24320;&#22987;&#26469;&#20889;&#19968;&#20010;decorator!</p>
<h3>9&#12289;&#35013;&#39280;&#22120;&#65288;Decorators&#65289;</h3>
<p>&#19968;&#20010;decorator&#21482;&#26159;&#19968;&#20010;&#24102;&#26377;&#19968;&#20010;&#20989;&#25968;&#20316;&#20026;&#21442;&#25968;&#24182;&#36820;&#22238;&#19968;&#20010;&#26367;&#25442;&#20989;&#25968;&#30340;&#38381;&#21253;&#12290;&#25105;&#20204;&#23558;&#20174;&#31616;&#21333;&#30340;&#24320;&#22987;&#19968;&#30452;&#21040;&#20889;&#20986;&#26377;&#29992;&#30340;decorators&#12290;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def outer(some_func):
...        def inner():
...            print "before some_func"
...            ret = some_func() # 1
...            return ret + 1
...        return inner
&gt;&gt;&gt; def foo():
...        return 1
&gt;&gt;&gt; decorated = outer(foo) # 2
&gt;&gt;&gt; decorated()
before some_func
2
</pre></div>


<p>&#35831;&#20180;&#32454;&#30475;&#25105;&#20204;&#30340;decorator&#23454;&#20363;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#25509;&#21463;&#21333;&#20010;&#21442;&#25968;some_func&#30340;&#21517;&#20026;outer&#30340;&#20989;&#25968;&#12290;&#22312;outer&#20869;&#37096;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#21517;&#20026;inner&#30340;&#23884;&#22871;&#20989;&#25968;&#12290;inner&#20989;&#25968;&#25171;&#21360;&#19968;&#20010;&#23383;&#31526;&#20018;&#28982;&#21518;&#35843;&#29992;some_func&#65292;&#22312;#1&#22788;&#32531;&#23384;&#23427;&#30340;&#36820;&#22238;&#20540;&#12290;some_func&#30340;&#20540;&#21487;&#33021;&#22312;&#27599;&#27425;outer&#34987;&#35843;&#29992;&#26102;&#19981;&#21516;&#65292;&#20294;&#26159;&#26080;&#35770;&#23427;&#26159;&#20160;&#20040;&#25105;&#20204;&#37117;&#23558;&#35843;&#29992;&#23427;&#12290;&#26368;&#32456;&#65292;inner&#36820;&#22238;some_func&#30340;&#36820;&#22238;&#20540;&#21152;1&#65292;&#24182;&#19988;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#65292;&#24403;&#25105;&#20204;&#35843;&#29992;&#23384;&#20648;&#20110;#2&#22788;decorated&#37324;&#30340;&#36820;&#22238;&#20989;&#25968;&#26102;&#25105;&#20204;&#24471;&#21040;&#20102;&#36755;&#20986;&#30340;&#25991;&#26412;&#21644;&#19968;&#20010;&#36820;&#22238;&#20540;2&#32780;&#19981;&#26159;&#25105;&#20204;&#26399;&#26395;&#30340;&#35843;&#29992;foo&#20135;&#29983;&#30340;&#21407;&#22987;&#20540;1.</p>
<p>&#25105;&#20204;&#21487;&#20197;&#35828;decorated&#21464;&#37327;&#26159;foo&#30340;&#19968;&#20010;&#8220;&#35013;&#39280;&#8221;&#29256;&#26412;&#8212;&#8212;&#30001;foo&#21152;&#19978;&#19968;&#20123;&#19996;&#35199;&#26500;&#25104;&#12290;&#23454;&#38469;&#19978;&#65292;&#22914;&#26524;&#25105;&#20204;&#20889;&#20102;&#19968;&#20010;&#26377;&#29992;&#30340;decorator&#65292;&#25105;&#20204;&#21487;&#33021;&#24819;&#29992;&#35013;&#39280;&#21518;&#30340;&#29256;&#26412;&#26469;&#26367;&#25442;foo&#65292;&#20174;&#32780;&#21487;&#20197;&#24471;&#21040;foo&#30340;&#8220;&#22686;&#28155;&#26576;&#20123;&#19996;&#35199;&#8221;&#30340;&#29256;&#26412;&#12290;&#25105;&#20204;&#21487;&#20197;&#19981;&#29992;&#23398;&#20064;&#20219;&#20309;&#26032;&#35821;&#27861;&#32780;&#20570;&#21040;&#36825;&#19968;&#28857;&#8212;&#8212;&#37325;&#26032;&#23558;&#21253;&#21547;&#25105;&#20204;&#20989;&#25968;&#30340;&#21464;&#37327;&#36827;&#34892;&#36171;&#20540;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; foo = outer(foo)
&gt;&gt;&gt; foo # doctest: +ELLIPSIS
&lt;function inner at 0x...&gt;
</pre></div>


<p>&#29616;&#22312;&#20219;&#20309;&#23545;foo()&#30340;&#35843;&#29992;&#37117;&#19981;&#20250;&#24471;&#21040;&#21407;&#22987;&#30340;foo&#65292;&#32780;&#26159;&#20250;&#24471;&#21040;&#25105;&#20204;&#32463;&#36807;&#35013;&#39280;&#30340;&#29256;&#26412;&#65281;&#39046;&#24735;&#21040;&#20102;&#19968;&#20123;decorator&#30340;&#24605;&#24819;&#21527;&#65311;</p>
<h3>10&#12289;&#35013;&#39280;&#22120;&#30340;&#35821;&#27861;&#31958;--@&#31526;&#21495;&#65288;The @ symbol applies a decorator to a function&#65289;</h3>
<p>Python 2.4&#36890;&#36807;&#22312;&#20989;&#25968;&#23450;&#20041;&#21069;&#28155;&#21152;&#19968;&#20010;@&#31526;&#21495;&#23454;&#29616;&#23545;&#20989;&#25968;&#30340;&#21253;&#35013;&#12290;&#22312;&#19978;&#38754;&#30340;&#20195;&#30721;&#31034;&#20363;&#20013;&#65292;&#25105;&#20204;&#29992;&#19968;&#20010;&#21253;&#35013;&#20102;&#30340;&#20989;&#25968;&#26469;&#26367;&#25442;&#21253;&#21547;&#20989;&#25968;&#30340;&#21464;&#37327;&#26469;&#23454;&#29616;&#20102;&#21253;&#35013;&#12290;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; add = wrapper(add)
</pre></div>


<p>&#36825;&#19968;&#27169;&#24335;&#20219;&#20309;&#26102;&#20505;&#37117;&#21487;&#20197;&#29992;&#26469;&#21253;&#35013;&#20219;&#20309;&#20989;&#25968;&#65292;&#20294;&#26159;&#22914;&#26524;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#20989;&#25968;&#65292;&#25105;&#20204;&#21487;&#20197;&#29992;@&#31526;&#21495;&#20687;&#19979;&#38754;&#31034;&#20363;&#37027;&#26679;&#21253;&#35013;&#23427;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; @wrapper
... def add(a, b):
...     return Coordinate(a.x + b.x, a.y + b.y)
</pre></div>


<p>&#35831;&#27880;&#24847;&#65292;&#36825;&#31181;&#26041;&#24335;&#21644;&#29992;wrapper&#20989;&#25968;&#30340;&#36820;&#22238;&#20540;&#26469;&#26367;&#25442;&#21407;&#22987;&#21464;&#37327;&#24182;&#27809;&#26377;&#20219;&#20309;&#19981;&#21516;&#65292;Python&#21482;&#26159;&#22686;&#28155;&#20102;&#19968;&#20123;&#35821;&#27861;&#31958;(syntactic sugar)&#35753;&#23427;&#30475;&#36215;&#26469;&#26356;&#26126;&#26174;&#19968;&#28857;&#12290;</p>
<h3>11&#12289;*args and **kwargs</h3>
<p>&#25105;&#20204;&#24050;&#32463;&#20889;&#20102;&#19968;&#20010;&#26377;&#29992;&#30340;decorator&#65292;&#20294;&#26159;&#23427;&#26159;&#30828;&#32534;&#30721;&#30340;&#65292;&#23427;&#21482;&#36866;&#29992;&#20110;&#29305;&#23450;&#31181;&#31867;&#30340;&#20989;&#25968;&#8212;&#8212;&#24102;&#26377;&#20004;&#20010;&#21442;&#25968;&#30340;&#20989;&#25968;&#12290;&#25105;&#20204;&#20989;&#25968;&#20869;&#37096;&#30340;checker&#20989;&#25968;&#25509;&#21463;&#20102;&#20004;&#20010;&#21442;&#25968;&#65292;&#28982;&#21518;&#32487;&#32493;&#23558;&#21442;&#25968;&#38381;&#21253;&#37324;&#30340;&#20989;&#25968;&#12290;&#22914;&#26524;&#25105;&#20204;&#24819;&#35201;&#19968;&#20010;&#33021;&#21253;&#35013;&#20219;&#20309;&#31867;&#22411;&#20989;&#25968;&#30340;decorator&#21602;&#65311;&#35753;&#25105;&#20204;&#23454;&#29616;&#19968;&#20010;&#22312;&#19981;&#25913;&#21464;&#34987;&#21253;&#35013;&#20989;&#25968;&#30340;&#21069;&#25552;&#19979;&#23545;&#27599;&#19968;&#27425;&#34987;&#21253;&#35013;&#20989;&#25968;&#30340;&#35843;&#29992;&#22686;&#28155;&#19968;&#27425;&#35745;&#25968;&#30340;&#21253;&#35013;&#22120;&#12290;&#36825;&#24847;&#21619;&#30528;&#36825;&#20010;decorator&#38656;&#35201;&#25509;&#21463;&#25152;&#26377;&#24453;&#21253;&#35013;&#30340;&#20219;&#20309;&#20989;&#25968;&#24182;&#23558;&#20256;&#36882;&#32473;&#23427;&#30340;&#20219;&#20309;&#21442;&#25968;&#20256;&#36882;&#32473;&#34987;&#21253;&#35013;&#30340;&#20989;&#25968;&#26469;&#35843;&#29992;&#23427;&#65288;&#34987;&#21253;&#35013;&#30340;&#20989;&#25968;&#65289;&#12290;</p>
<p>&#36825;&#31181;&#24773;&#20917;&#24456;&#24120;&#35265;&#65292;&#25152;&#20197;Python&#20026;&#36825;&#19968;&#29305;&#24615;&#25552;&#20379;&#20102;&#35821;&#27861;&#25903;&#25345;&#12290;&#35831;&#30830;&#20445;&#38405;&#35835;<a href="http://docs.python.org/tutorial/controlflow.html#arbitrary-argument-lists">Python Tutorial</a>&#20197;&#20102;&#35299;&#26356;&#22810;&#65292;&#20294;&#26159;&#22312;&#20989;&#25968;&#23450;&#20041;&#26102;&#20351;&#29992;*&#36816;&#31639;&#31526;&#24847;&#21619;&#30528;&#20219;&#20309;&#20256;&#36882;&#32473;&#20989;&#25968;&#30340;&#39069;&#22806;&#20301;&#32622;&#21442;&#25968;&#26368;&#32456;&#20197;&#19968;&#20010;*&#20316;&#20026;&#21069;&#23548;&#12290;&#22240;&#27492;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def one(*args):
...     print args # 1
&gt;&gt;&gt; one()
()
&gt;&gt;&gt; one(1, 2, 3)
(1, 2, 3)
&gt;&gt;&gt; def two(x, y, *args): # 2
...     print x, y, args
&gt;&gt;&gt; two('a', 'b', 'c')
a b ('c')
</pre></div>


<p>&#31532;&#19968;&#20010;&#20989;&#25968;one&#21482;&#26159;&#31616;&#21333;&#30340;&#23558;&#20219;&#20309;&#65288;&#22914;&#26524;&#26377;&#65289;&#20256;&#36882;&#32473;&#23427;&#30340;&#20301;&#32622;&#21442;&#25968;&#25171;&#21360;&#20986;&#26469;&#12290;&#27491;&#22914;&#20320;&#22312;#1&#22788;&#35265;&#21040;&#30340;&#65292;&#22312;&#20989;&#25968;&#20869;&#37096;&#25105;&#20204;&#21482;&#26159;&#24341;&#29992;&#20102;args&#21464;&#37327;&#8212;&#8212;*args&#21482;&#26159;&#34920;&#26126;&#22312;&#20989;&#25968;&#23450;&#20041;&#20013;&#20301;&#32622;&#21442;&#25968;&#24212;&#35813;&#20445;&#23384;&#22312;&#21464;&#37327;args&#20013;&#12290;Python&#20063;&#20801;&#35768;&#25105;&#20204;&#25351;&#23450;&#19968;&#20123;&#21464;&#37327;&#24182;&#25429;&#33719;&#21040;&#20219;&#20309;&#22312;args&#21464;&#37327;&#37324;&#30340;&#20854;&#23427;&#21442;&#25968;&#65292;&#27491;&#22914;#2&#22788;&#25152;&#31034;&#12290;</p>
<p>*&#36816;&#31639;&#31526;&#20063;&#21487;&#20197;&#29992;&#20110;&#20989;&#25968;&#35843;&#29992;&#20013;&#65292;&#36825;&#26102;&#23427;&#20063;&#26377;&#30528;&#31867;&#20284;&#30340;&#24847;&#20041;&#12290;&#22312;&#35843;&#29992;&#19968;&#20010;&#20989;&#25968;&#26102;&#24102;&#26377;&#19968;&#20010;&#20197;*&#20026;&#21069;&#23548;&#30340;&#21464;&#37327;&#20316;&#20026;&#21442;&#25968;&#34920;&#31034;&#36825;&#20010;&#21464;&#37327;&#20869;&#23481;&#38656;&#35201;&#34987;&#35299;&#26512;&#28982;&#21518;&#29992;&#20316;&#20301;&#32622;&#21442;&#25968;&#12290;&#20877;&#19968;&#27425;&#20197;&#23454;&#20363;&#26469;&#35828;&#26126;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def add(x, y):
...     return x + y
&gt;&gt;&gt; lst = [1, 2]
&gt;&gt;&gt; add(lst[0], lst[1]) # 1
3
&gt;&gt;&gt; add(*lst) # 2
3
</pre></div>


<p>#1&#22788;&#30340;&#20195;&#30721;&#25277;&#21462;&#20986;&#20102;&#21644;#2&#22788;&#30456;&#21516;&#30340;&#21442;&#25968;&#8212;&#8212;&#22312;#2&#22788;Python&#20026;&#25105;&#20204;&#33258;&#21160;&#35299;&#26512;&#20102;&#21442;&#25968;&#65292;&#25105;&#20204;&#20063;&#21487;&#20197;&#20687;&#22312;#1&#22788;&#19968;&#26679;&#33258;&#24049;&#35299;&#26512;&#20986;&#26469;&#12290;&#36825;&#30475;&#36215;&#26469;&#19981;&#38169;&#65292;*args&#26082;&#34920;&#31034;&#24403;&#35843;&#29992;&#20989;&#25968;&#26159;&#20174;&#19968;&#20010;iterable&#25277;&#21462;&#20301;&#32622;&#21442;&#25968;&#65292;&#20063;&#34920;&#31034;&#24403;&#23450;&#20041;&#19968;&#20010;&#20989;&#25968;&#26159;&#25509;&#21463;&#20219;&#20309;&#39069;&#22806;&#30340;&#20301;&#32622;&#21464;&#37327;&#12290;</p>
<p>&#24403;&#25105;&#20204;&#24341;&#20837;**&#26102;&#65292;&#20107;&#24773;&#21464;&#24471;&#26356;&#21152;&#22797;&#26434;&#28857;&#65292;&#19982;*&#34920;&#31034;iterables&#21644;&#20301;&#32622;&#21442;&#25968;&#19968;&#26679;&#65292;**&#34920;&#31034;dictionaries &amp; key/value&#23545;&#12290;&#24456;&#31616;&#21333;&#65292;&#19981;&#26159;&#20040;&#65311;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def foo(**kwargs):
...     print kwargs
&gt;&gt;&gt; foo()
{}
&gt;&gt;&gt; foo(x=1, y=2)
{'y': 2, 'x': 1}
</pre></div>


<p>&#24403;&#25105;&#20204;&#23450;&#20041;&#19968;&#20010;&#20989;&#25968;&#26102;&#25105;&#20204;&#21487;&#20197;&#29992;**kwargs&#34920;&#26126;&#25152;&#26377;&#26410;&#25429;&#33719;&#30340;keyword&#21464;&#37327;&#24212;&#35813;&#34987;&#23384;&#20648;&#22312;&#19968;&#20010;&#21517;&#20026;kwargs&#30340;&#23383;&#20856;&#20013;&#12290;&#21069;&#38754;&#30340;&#20363;&#23376;&#20013;&#30340;args&#21644;&#26412;&#20363;&#20013;&#30340;kwargs&#37117;&#19981;&#26159;Python&#35821;&#27861;&#30340;&#19968;&#37096;&#20998;&#65292;&#20294;&#26159;&#22312;&#20989;&#25968;&#23450;&#20041;&#26102;&#20351;&#29992;&#36825;&#20004;&#20010;&#20316;&#20026;&#21464;&#37327;&#21517;&#26102;&#19968;&#31181;&#24815;&#20363;&#12290;&#23601;&#20687;*&#19968;&#26679;&#65292;&#25105;&#20204;&#21487;&#20197;&#22312;&#20989;&#25968;&#35843;&#29992;&#26102;&#20351;&#29992;**&#12290;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; dct = {'x': 1, 'y': 2}
&gt;&gt;&gt; def bar(x, y):
...     rturn x + y
&gt;&gt;&gt; bar(**dct)
3
</pre></div>


<h3>12&#12289;&#26356;&#36890;&#29992;&#30340;&#35013;&#39280;&#22120;&#65288;More generic decorators&#65289;</h3>
<p>&#29992;&#25105;&#20204;&#25484;&#25569;&#30340;&#26032;&#8220;&#27494;&#22120;&#8221;&#25105;&#20204;&#21487;&#20197;&#20889;&#19968;&#20010;decorator&#29992;&#26469;&#8220;&#35760;&#24405;&#8221;&#20989;&#25968;&#30340;&#21442;&#25968;&#12290;&#20026;&#20102;&#31616;&#21333;&#36215;&#35265;&#65292;&#25105;&#20204;&#23558;&#20854;&#25171;&#21360;&#22312;stdout&#19978;&#65306;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; def logger(func):
...     def inner(*args, **kwargs): # 1
...     print "Arguments were: %s, %s" % (args, kwargs)
...     return func(*args, **kwargs) # 2
... return inner
</pre></div>


<p>&#27880;&#24847;&#21040;&#22312;#1&#22788;inner&#20989;&#25968;&#24102;&#26377;&#20219;&#24847;&#25968;&#37327;&#30340;&#20219;&#20309;&#31867;&#22411;&#30340;&#21442;&#25968;&#65292;&#28982;&#21518;&#22312;#2&#22788;&#23558;&#23427;&#20204;&#20256;&#36882;&#21040;&#34987;&#21253;&#35013;&#30340;&#20989;&#25968;&#20013;&#12290;&#36825;&#20801;&#35768;&#25105;&#20204;&#21253;&#35013;&#25110;&#32773;&#35013;&#39280;&#20219;&#20309;&#20989;&#25968;&#12290;</p>
<div class="highlight"><pre><span/>&gt;&gt;&gt; @logger
... def foo1(x, y=1):
...     return x * y
&gt;&gt;&gt; @logger
... def foo2():
...     return 2
&gt;&gt;&gt; foo1(5, 4)
Arguments were: (5, 4), {}
20
&gt;&gt;&gt; foo1(1)
Arguments were: (1,), {}
1
&gt;&gt;&gt; foo2()
Arguments were: (),{}
2
</pre></div>


<p>&#23545;&#20989;&#25968;&#30340;&#35843;&#29992;&#20250;&#20135;&#29983;&#19968;&#20010;"logging"&#36755;&#20986;&#34892;&#65292;&#20063;&#20250;&#36755;&#20986;&#19968;&#20010;&#22914;&#25105;&#20204;&#26399;&#26395;&#30340;&#20989;&#25968;&#36820;&#22238;&#20540;&#12290;</p>
<p>&#22914;&#26524;&#20320;&#19968;&#30452;&#36319;&#21040;&#20102;&#26368;&#21518;&#19968;&#20010;&#23454;&#20363;&#65292;&#31069;&#36154;&#20320;&#65292;&#20320;&#24050;&#32463;&#29702;&#35299;&#20102;decorators&#20102;&#65281;&#20320;&#21487;&#20197;&#29992;&#20320;&#26032;&#25484;&#25569;&#30340;&#8220;&#27494;&#22120;&#8221;&#20570;&#26356;&#22909;&#30340;&#20107;&#24773;&#20102;&#12290;&#20320;&#20063;&#21487;&#33021;&#32771;&#34385;&#36827;&#19968;&#27493;&#23398;&#20064;&#65292;<a href="http://www.artima.com/weblogs/viewpost.jsp?thread=240808">Bruce Eckel&#26377;&#19968;&#31687;&#20851;&#20110;decorators&#30340;&#20248;&#31168;&#25991;&#31456;</a>&#65292;&#20182;&#20351;&#29992;&#23545;&#35937;&#32780;&#19981;&#26159;&#20989;&#25968;&#23454;&#29616;&#20102;decorator&#12290;&#20320;&#21487;&#33021;&#20250;&#21457;&#29616;OOP&#20195;&#30721;&#27604;&#25105;&#20204;&#30340;&#32431;&#20989;&#25968;&#29256;&#26412;&#26356;&#20855;&#21487;&#35835;&#24615;&#12290;Bruce&#36824;&#26377;&#19968;&#31687;&#21518;&#32493;&#25991;&#65292;<a href="http://www.artima.com/weblogs/viewpost.jsp?thread=240845">providing parameters to decorators</a>&#65292;&#29992;&#23545;&#35937;&#23454;&#29616;&#23427;&#21487;&#33021;&#20063;&#27604;&#20989;&#25968;&#23454;&#29616;&#26356;&#31616;&#21333;&#12290;&#26368;&#21518;&#65292;&#20320;&#20063;&#21487;&#33021;&#20250;&#21435;&#25506;&#26597;&#19968;&#19979;&#20869;&#24314;&#30340;<a href="http://docs.python.org/dev/library/functools.html">functools</a>wraps&#20989;&#25968;&#65292;&#23427;&#26159;&#19968;&#20010;&#21487;&#20197;&#29992;&#22312;&#25105;&#20204;&#30340;&#35013;&#39280;&#22120;&#20013;&#29992;&#26469;&#20462;&#25913;&#20989;&#25968;&#30340;&#31614;&#21517;&#30340;&#35013;&#39280;&#22120;&#65292;&#20462;&#25913;&#20043;&#21518;d&#30340;&#20989;&#25968;&#26356;&#20687;&#34987;&#35013;&#39280;&#30340;&#20989;&#25968;&#12290;</p>
<p>&#33521;&#25991;&#21407;&#25991;&#65306;http://simeonfranklin.com/blog/2012/jul/1/python-decorators-in-12-steps/#section_10</p>
        <br/>
        </article>

<p>Original:https://foofish.net/python-decorator-12.html</p>
                </div><!-- /.entry-content -->
                <!-- 来必力City版安装代码 -->
                <div id="lv-container" data-id="city" data-uid="MTAyMC8zNjgwNi8xMzM0Mg==">
                    <script type="text/javascript">
                   (function(d, s) {
                       var j, e = d.getElementsByTagName(s)[0];

                       if (typeof LivereTower === 'function') { return; }

                       j = d.createElement(s);
                       j.src = 'https://cdn-city.livere.com/js/embed.dist.js';
                       j.async = true;

                       e.parentNode.insertBefore(j, e);
                   })(document, 'script');
                    </script>
                <noscript> 为正常使用来必力评论功能请激活JavaScript</noscript>
                </div>
                <!-- City版安装代码已完成 -->
        </article>
</section>
        </div><!--/span-->

                <div class="span3 well sidebar-nav" id="sidebar">
<ul class="nav nav-list">
<li class="nav-header"><h4><i class="icon-external-link"></i>blogroll</h4></li>
    <li><a href="http://getpelican.com/"><i class="icon-external-link"></i>Pelican</a></li>
    <li><a href="http://python.org/"><i class="icon-external-link"></i>Python.org</a></li>
    <li><a href="http://jinja.pocoo.org/"><i class="icon-external-link"></i>Jinja2</a></li>
    <li><a href="http://www.runoob.com/"><i class="icon-external-link"></i>Python教程</a></li>
    <li><a href="https://www.liaoxuefeng.com/wiki/0014316089557264a6b348958f449949df42a6d3a2e542c000"><i class="icon-external-link"></i>廖雪峰Python</a></li>
<li class="nav-header"><h4><i class="icon-home icon-large"></i> social</h4></li>
<li><a href="/feeds/all.atom.xml" rel="alternate"><i class="icon-bookmark icon-large"></i>atom feed</a></li>
    <li><a href="https://github.com/RuiJee"><i class="icon-Github-sign icon-large"></i>Github</a></li>

<li class="nav-header"><h4> <a href="/categories.html"><i class="icon-folder-close icon-large"></i>Categories</a></h4></li>
<li>
<a href="/category/code-example/index.html">
    <i class="icon-folder-open icon-large"></i>Code Example
</a>
</li>
<li>
<a href="/category/linux/index.html">
    <i class="icon-folder-open icon-large"></i>Linux
</a>
</li>
<li>
<a href="/category/pa-chong-ji-zhu/index.html">
    <i class="icon-folder-open icon-large"></i>爬虫技术
</a>
</li>
<li>
<a href="/category/pythonji-zhu/index.html">
    <i class="icon-folder-open icon-large"></i>Python技术
</a>
</li>

<li class="nav-header"><h4> <a href="/tags.html"><i class="icon-tags icon-large"></i>Tags</a></h4></li>
<li class="tag-4">
    <a href="/tag/method/index.html">
        <i class="icon-tag icon-large"></i>method
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_base/index.html">
        <i class="icon-tag icon-large"></i>code_base
    </a>
</li>
<li class="tag-4">
    <a href="/tag/cai-dan/index.html">
        <i class="icon-tag icon-large"></i>彩蛋
    </a>
</li>
<li class="tag-4">
    <a href="/tag/equals-identical/index.html">
        <i class="icon-tag icon-large"></i>equals-identical
    </a>
</li>
<li class="tag-3">
    <a href="/tag/pycharm/index.html">
        <i class="icon-tag icon-large"></i>pycharm
    </a>
</li>
<li class="tag-3">
    <a href="/tag/list/index.html">
        <i class="icon-tag icon-large"></i>list
    </a>
</li>
<li class="tag-4">
    <a href="/tag/timestamp/index.html">
        <i class="icon-tag icon-large"></i>timestamp
    </a>
</li>
<li class="tag-4">
    <a href="/tag/python27/index.html">
        <i class="icon-tag icon-large"></i>python27
    </a>
</li>
<li class="tag-4">
    <a href="/tag/singleton/index.html">
        <i class="icon-tag icon-large"></i>singleton
    </a>
</li>
<li class="tag-4">
    <a href="/tag/iterable/index.html">
        <i class="icon-tag icon-large"></i>iterable
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_security/index.html">
        <i class="icon-tag icon-large"></i>code_security
    </a>
</li>
<li class="tag-4">
    <a href="/tag/jie-huo/index.html">
        <i class="icon-tag icon-large"></i>解惑
    </a>
</li>
<li class="tag-4">
    <a href="/tag/with/index.html">
        <i class="icon-tag icon-large"></i>with
    </a>
</li>
<li class="tag-4">
    <a href="/tag/legb/index.html">
        <i class="icon-tag icon-large"></i>legb
    </a>
</li>
<li class="tag-4">
    <a href="/tag/zuo-yong-yu/index.html">
        <i class="icon-tag icon-large"></i>作用域
    </a>
</li>
<li class="tag-3">
    <a href="/tag/suan-fa/index.html">
        <i class="icon-tag icon-large"></i>算法
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_gui/index.html">
        <i class="icon-tag icon-large"></i>code_gui
    </a>
</li>
<li class="tag-3">
    <a href="/tag/python3/index.html">
        <i class="icon-tag icon-large"></i>python3
    </a>
</li>
<li class="tag-4">
    <a href="/tag/luan-ma/index.html">
        <i class="icon-tag icon-large"></i>乱码
    </a>
</li>
<li class="tag-4">
    <a href="/tag/re/index.html">
        <i class="icon-tag icon-large"></i>re
    </a>
</li>
<li class="tag-4">
    <a href="/tag/ming-ming-kong-jian/index.html">
        <i class="icon-tag icon-large"></i>命名空间
    </a>
</li>
<li class="tag-4">
    <a href="/tag/gc/index.html">
        <i class="icon-tag icon-large"></i>gc
    </a>
</li>
<li class="tag-4">
    <a href="/tag/fudge/index.html">
        <i class="icon-tag icon-large"></i>fudge
    </a>
</li>
<li class="tag-4">
    <a href="/tag/for/index.html">
        <i class="icon-tag icon-large"></i>for
    </a>
</li>
<li class="tag-3">
    <a href="/tag/dict/index.html">
        <i class="icon-tag icon-large"></i>dict
    </a>
</li>
<li class="tag-4">
    <a href="/tag/rename/index.html">
        <i class="icon-tag icon-large"></i>rename
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_linux/index.html">
        <i class="icon-tag icon-large"></i>code_linux
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_demos/index.html">
        <i class="icon-tag icon-large"></i>code_Demos
    </a>
</li>
<li class="tag-2">
    <a href="/tag/bian-ma/index.html">
        <i class="icon-tag icon-large"></i>编码
    </a>
</li>
<li class="tag-3">
    <a href="/tag/requests/index.html">
        <i class="icon-tag icon-large"></i>requests
    </a>
</li>
<li class="tag-4">
    <a href="/tag/pip/index.html">
        <i class="icon-tag icon-large"></i>pip
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_scripts-shell/index.html">
        <i class="icon-tag icon-large"></i>code_scripts-shell
    </a>
</li>
<li class="tag-4">
    <a href="/tag/django/index.html">
        <i class="icon-tag icon-large"></i>django
    </a>
</li>
<li class="tag-4">
    <a href="/tag/book/index.html">
        <i class="icon-tag icon-large"></i>book
    </a>
</li>
<li class="tag-4">
    <a href="/tag/tuple/index.html">
        <i class="icon-tag icon-large"></i>tuple
    </a>
</li>
<li class="tag-4">
    <a href="/tag/str/index.html">
        <i class="icon-tag icon-large"></i>str
    </a>
</li>
<li class="tag-4">
    <a href="/tag/yield/index.html">
        <i class="icon-tag icon-large"></i>yield
    </a>
</li>
<li class="tag-3">
    <a href="/tag/iterator/index.html">
        <i class="icon-tag icon-large"></i>iterator
    </a>
</li>
<li class="tag-4">
    <a href="/tag/virtualenv/index.html">
        <i class="icon-tag icon-large"></i>virtualenv
    </a>
</li>
<li class="tag-4">
    <a href="/tag/ru-men/index.html">
        <i class="icon-tag icon-large"></i>入门
    </a>
</li>
<li class="tag-2">
    <a href="/tag/python/index.html">
        <i class="icon-tag icon-large"></i>python
    </a>
</li>
<li class="tag-4">
    <a href="/tag/centos/index.html">
        <i class="icon-tag icon-large"></i>centos
    </a>
</li>
<li class="tag-4">
    <a href="/tag/zheng-ze-biao-da-shi/index.html">
        <i class="icon-tag icon-large"></i>正则表达式
    </a>
</li>
<li class="tag-4">
    <a href="/tag/beautifulsoup/index.html">
        <i class="icon-tag icon-large"></i>beautifulsoup
    </a>
</li>
<li class="tag-4">
    <a href="/tag/ci-yun/index.html">
        <i class="icon-tag icon-large"></i>词云
    </a>
</li>
<li class="tag-4">
    <a href="/tag/tornado/index.html">
        <i class="icon-tag icon-large"></i>tornado
    </a>
</li>
<li class="tag-4">
    <a href="/tag/int/index.html">
        <i class="icon-tag icon-large"></i>int
    </a>
</li>
<li class="tag-4">
    <a href="/tag/decorator/index.html">
        <i class="icon-tag icon-large"></i>decorator
    </a>
</li>
<li class="tag-3">
    <a href="/tag/han-shu/index.html">
        <i class="icon-tag icon-large"></i>函数
    </a>
</li>
<li class="tag-4">
    <a href="/tag/lsof/index.html">
        <i class="icon-tag icon-large"></i>lsof
    </a>
</li>
<li class="tag-4">
    <a href="/tag/datetime/index.html">
        <i class="icon-tag icon-large"></i>datetime
    </a>
</li>
<li class="tag-4">
    <a href="/tag/biao-qian-yun/index.html">
        <i class="icon-tag icon-large"></i>标签云
    </a>
</li>
<li class="tag-4">
    <a href="/tag/stringio/index.html">
        <i class="icon-tag icon-large"></i>stringio
    </a>
</li>
<li class="tag-4">
    <a href="/tag/zhi-hu/index.html">
        <i class="icon-tag icon-large"></i>知乎
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_graphics/index.html">
        <i class="icon-tag icon-large"></i>code_graphics
    </a>
</li>
<li class="tag-4">
    <a href="/tag/djang-blog/index.html">
        <i class="icon-tag icon-large"></i>djang-blog
    </a>
</li>
<li class="tag-4">
    <a href="/tag/thread/index.html">
        <i class="icon-tag icon-large"></i>thread
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_algorithm/index.html">
        <i class="icon-tag icon-large"></i>code_algorithm
    </a>
</li>
<li class="tag-4">
    <a href="/tag/code_mobile/index.html">
        <i class="icon-tag icon-large"></i>code_mobile
    </a>
</li>
<li class="tag-3">
    <a href="/tag/generator/index.html">
        <i class="icon-tag icon-large"></i>generator
    </a>
</li>
<li class="tag-4">
    <a href="/tag/shu/index.html">
        <i class="icon-tag icon-large"></i>书
    </a>
</li>
<li class="tag-4">
    <a href="/tag/intern/index.html">
        <i class="icon-tag icon-large"></i>intern
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_text-file/index.html">
        <i class="icon-tag icon-large"></i>code_text-file
    </a>
</li>
<li class="tag-3">
    <a href="/tag/http/index.html">
        <i class="icon-tag icon-large"></i>http
    </a>
</li>
<li class="tag-4">
    <a href="/tag/dian-zi-shu/index.html">
        <i class="icon-tag icon-large"></i>电子书
    </a>
</li>
<li class="tag-3">
    <a href="/tag/pythonic/index.html">
        <i class="icon-tag icon-large"></i>pythonic
    </a>
</li>
<li class="tag-3">
    <a href="/tag/shi-xian-yuan-li/index.html">
        <i class="icon-tag icon-large"></i>实现原理
    </a>
</li>
<li class="tag-2">
    <a href="/tag/linux/index.html">
        <i class="icon-tag icon-large"></i>linux
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_other/index.html">
        <i class="icon-tag icon-large"></i>code_other
    </a>
</li>
<li class="tag-2">
    <a href="/tag/pa-chong/index.html">
        <i class="icon-tag icon-large"></i>爬虫
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_game/index.html">
        <i class="icon-tag icon-large"></i>code_game
    </a>
</li>
<li class="tag-4">
    <a href="/tag/free/index.html">
        <i class="icon-tag icon-large"></i>free
    </a>
</li>
<li class="tag-4">
    <a href="/tag/lambda/index.html">
        <i class="icon-tag icon-large"></i>lambda
    </a>
</li>
<li class="tag-4">
    <a href="/tag/metaclass/index.html">
        <i class="icon-tag icon-large"></i>metaclass
    </a>
</li>
<li class="tag-4">
    <a href="/tag/extractor/index.html">
        <i class="icon-tag icon-large"></i>extractor
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_mail/index.html">
        <i class="icon-tag icon-large"></i>code_mail
    </a>
</li>
<li class="tag-4">
    <a href="/tag/bi-bao/index.html">
        <i class="icon-tag icon-large"></i>闭包
    </a>
</li>
<li class="tag-3">
    <a href="/tag/zhuang-shi-qi/index.html">
        <i class="icon-tag icon-large"></i>装饰器
    </a>
</li>


</ul>        </div><!--/.well -->

      </div><!--/row-->

      <hr>

      <footer>
        <!--<address id="about">
                Proudly powered by <a href="http://pelican.notmyidea.org/">Pelican <i class="icon-external-link"></i></a>,
                                which takes great advantage of <a href="http://python.org">Python <i class="icon-external-link"></i></a>.
        </address>--><!-- /#about -->

       <!-- <p>The theme is from <a href="http://twitter.github.com/bootstrap/">Bootstrap from Twitter <i class="icon-external-link"></i></a>,
                   and <a href="http://fortawesome.github.com/Font-Awesome/">Font-Awesome <i class="icon-external-link"></i></a>, thanks!</p>-->
         <p>&copy; Alex 2018</p>
      </footer>

    </div><!--/.fluid-container-->



    <!-- Le javascript -->
    <!-- Placed at the end of the document so the pages load faster -->
    <!--<script src="/theme/js/jquery-1.7.2.min.js"></script>-->
    <script src="/theme/js/bootstrap.min.js"></script>
  </body>
</html>