<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>Python中的垃圾回收机制</title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="">
    <meta name="author" content="Alex">

    <!-- Le styles -->
    <link rel="stylesheet" href="/theme/css/bootstrap.min.css" type="text/css" />
    <link rel="stylesheet" href="/theme/css/nest.css" type="text/css" />
    <link rel="stylesheet" href="/theme/css/fonts.css" type="text/css" />
    <style type="text/css">
      body {
        padding-top: 60px;
        padding-bottom: 40px;
      }
      .sidebar-nav {
        padding: 9px 0;
      }
      .tag-1 {
        font-size: 13pt;
      }
      .tag-2 {
        font-size: 10pt;
      }
      .tag-2 {
        font-size: 8pt;
      }
      .tag-4 {
        font-size: 6pt;
     }
    </style>
    <link href="/theme/css/bootstrap-responsive.min.css" rel="stylesheet">
        <link href="/theme/css/font-awesome.css" rel="stylesheet">

    <link href="/theme/css/pygments.css" rel="stylesheet">

    <!--<link href="/theme/css/base.css" rel="stylesheet">-->

    <script src="/theme/js/jquery-1.7.2.min.js"></script>



    <!-- Le HTML5 shim, for IE6-8 support of HTML5 elements -->
    <!--[if lt IE 9]>
      <script src="//html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <!-- Le fav and touch icons -->
    <link rel="shortcut icon" href="/theme/images/favicon.ico">
    <link rel="apple-touch-icon" href="/theme/images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="/theme/images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="/theme/images/apple-touch-icon-114x114.png">

    <link href="/" type="application/atom+xml" rel="alternate" title="Alex's Blog ATOM Feed" />

  </head>

  <body>

    <div class="navbar navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container-fluid">
          <a class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse">
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </a>
          <a class="brand" href="/index.html">Alex's Blog </a>
          <div class="nav-collapse">
            <ul class="nav">
                          <li class="divider-vertical"></li>
                  <li >
                    <a href="/category/code-example/index.html">
						<i class="icon-folder-open icon-large"></i>Code Example
					</a>
                  </li>
                  <li >
                    <a href="/category/linux/index.html">
						<i class="icon-folder-open icon-large"></i>Linux
					</a>
                  </li>
                  <li >
                    <a href="/category/pa-chong-ji-zhu/index.html">
						<i class="icon-folder-open icon-large"></i>爬虫技术
					</a>
                  </li>
                  <li class="active">
                    <a href="/category/pythonji-zhu/index.html">
						<i class="icon-folder-open icon-large"></i>Python技术
					</a>
                  </li>
                              <!--<li ><a href="/categories.html"><i class="icon-folder-close icon-large"></i>Categories</a></li>-->
                                <li><a href="/tags.html"><i class="icon-tags icon-large"></i>Tags</a></li>
                          <ul class="nav pull-right">

                                <li><a href="/archives.html"><i class="icon-th-list"></i>文章列表</a></li>
                          </ul>

            </ul>
            <!--<p class="navbar-text pull-right">Logged in as <a href="#">username</a></p>-->
          </div><!--/.nav-collapse -->
        </div>
      </div>
    </div>

    <div class="container-fluid">
      <div class="row">
        <div class="span9" id="content">
<section id="content">
        <article>
                <header>
                        <h1>
                                <a href=""
                                        rel="bookmark"
                                        title="Permalink to Python中的垃圾回收机制">
                                        Python中的垃圾回收机制
                                </a>
                        </h1>
                </header>
                <div class="entry-content">
                <div class="well">
<footer class="post-info">
<span class="label">Date</span>
<abbr class="published" title="2016-01-21T00:00:00+08:00">
        <i class="icon-calendar"></i>Thu 21 January 2016
</abbr>
<span class="label">By</span>
<a href="/author/alex/"><i class="icon-user"></i>Alex</a>
<span class="label">Category</span>
<a href="/category/pythonji-zhu/index.html"><i class="icon-folder-open"></i>Python技术</a>.


<span class="label">Tags</span>
	<a href="/tag/gc/index.html"><i class="icon-tag"></i>gc</a>
	<a href="/tag/python/index.html"><i class="icon-tag"></i>python</a>

</footer><!-- /.post-info -->                </div>
                <article>
        <p>GC&#20316;&#20026;&#29616;&#20195;&#32534;&#31243;&#35821;&#35328;&#30340;&#33258;&#21160;&#20869;&#23384;&#31649;&#29702;&#26426;&#21046;&#65292;&#19987;&#27880;&#20110;&#20004;&#20214;&#20107;&#65306;1. &#25214;&#21040;&#20869;&#23384;&#20013;&#26080;&#29992;&#30340;&#22403;&#22334;&#36164;&#28304; 2. &#28165;&#38500;&#36825;&#20123;&#22403;&#22334;&#24182;&#25226;&#20869;&#23384;&#35753;&#20986;&#26469;&#32473;&#20854;&#20182;&#23545;&#35937;&#20351;&#29992;&#12290;GC&#24443;&#24213;&#25226;&#31243;&#24207;&#21592;&#20174;&#36164;&#28304;&#31649;&#29702;&#30340;&#37325;&#25285;&#20013;&#35299;&#25918;&#20986;&#26469;&#65292;&#35753;&#20182;&#20204;&#26377;&#26356;&#22810;&#30340;&#26102;&#38388;&#25918;&#22312;&#19994;&#21153;&#36923;&#36753;&#19978;&#12290;&#20294;&#36825;&#24182;&#19981;&#24847;&#21619;&#30528;&#30721;&#20892;&#23601;&#21487;&#20197;&#19981;&#21435;&#20102;&#35299;GC&#65292;&#27605;&#31455;&#22810;&#20102;&#35299;GC&#30693;&#35782;&#36824;&#26159;&#26377;&#21033;&#20110;&#25105;&#20204;&#20889;&#20986;&#26356;&#20581;&#22766;&#30340;&#20195;&#30721;&#12290;</p>
<h3>&#24341;&#29992;&#35745;&#25968;</h3>
<p>Python&#35821;&#35328;&#40664;&#35748;&#37319;&#29992;&#30340;&#22403;&#22334;&#25910;&#38598;&#26426;&#21046;&#26159;&#12302;&#24341;&#29992;&#35745;&#25968;&#27861; Reference Counting&#12303;&#65292;&#35813;&#31639;&#27861;&#26368;&#26089;George E. Collins&#22312;1960&#30340;&#26102;&#20505;&#39318;&#27425;&#25552;&#20986;&#65292;50&#24180;&#21518;&#30340;&#20170;&#22825;&#65292;&#35813;&#31639;&#27861;&#20381;&#28982;&#34987;&#24456;&#22810;&#32534;&#31243;&#35821;&#35328;&#20351;&#29992;&#65292;&#12302;&#24341;&#29992;&#35745;&#25968;&#27861;&#12303;&#30340;&#21407;&#29702;&#26159;&#65306;&#27599;&#20010;&#23545;&#35937;&#32500;&#25252;&#19968;&#20010;<code>ob_ref</code>&#23383;&#27573;&#65292;&#29992;&#26469;&#35760;&#24405;&#35813;&#23545;&#35937;&#24403;&#21069;&#34987;&#24341;&#29992;&#30340;&#27425;&#25968;&#65292;&#27599;&#24403;&#26032;&#30340;&#24341;&#29992;&#25351;&#21521;&#35813;&#23545;&#35937;&#26102;&#65292;&#23427;&#30340;&#24341;&#29992;&#35745;&#25968;ob_ref&#21152;1&#65292;&#27599;&#24403;&#35813;&#23545;&#35937;&#30340;&#24341;&#29992;&#22833;&#25928;&#26102;&#35745;&#25968;ob_ref&#20943;1&#65292;&#19968;&#26086;&#23545;&#35937;&#30340;&#24341;&#29992;&#35745;&#25968;&#20026;0&#65292;&#35813;&#23545;&#35937;&#31435;&#21363;&#34987;&#22238;&#25910;&#65292;&#23545;&#35937;&#21344;&#29992;&#30340;&#20869;&#23384;&#31354;&#38388;&#23558;&#34987;&#37322;&#25918;&#12290;&#23427;&#30340;&#32570;&#28857;&#26159;&#38656;&#35201;&#39069;&#22806;&#30340;&#31354;&#38388;&#32500;&#25252;&#24341;&#29992;&#35745;&#25968;&#65292;&#36825;&#20010;&#38382;&#39064;&#26159;&#20854;&#27425;&#30340;&#65292;&#19981;&#36807;&#26368;&#20027;&#35201;&#30340;&#38382;&#39064;&#26159;&#23427;&#19981;&#33021;&#35299;&#20915;&#23545;&#35937;&#30340;&#8220;&#24490;&#29615;&#24341;&#29992;&#8221;&#65292;&#22240;&#27492;&#65292;&#20063;&#26377;&#24456;&#22810;&#35821;&#35328;&#27604;&#22914;Java&#24182;&#27809;&#26377;&#37319;&#29992;&#35813;&#31639;&#27861;&#20570;&#26469;&#22403;&#22334;&#30340;&#25910;&#38598;&#26426;&#21046;&#12290;</p>
<p>&#20160;&#20040;&#26159;&#24490;&#29615;&#24341;&#29992;&#65311;A&#21644;B&#30456;&#20114;&#24341;&#29992;&#32780;&#20877;&#27809;&#26377;&#22806;&#37096;&#24341;&#29992;A&#19982;B&#20013;&#30340;&#20219;&#20309;&#19968;&#20010;&#65292;&#23427;&#20204;&#30340;&#24341;&#29992;&#35745;&#25968;&#34429;&#28982;&#37117;&#20026;1&#65292;&#20294;&#26174;&#28982;&#24212;&#35813;&#34987;&#22238;&#25910;&#65292;&#20363;&#23376;&#65306;  </p>
<div class="highlight"><pre><span/>a = { } #&#23545;&#35937;A&#30340;&#24341;&#29992;&#35745;&#25968;&#20026; 1
b = { } #&#23545;&#35937;B&#30340;&#24341;&#29992;&#35745;&#25968;&#20026; 1
a['b'] = b  #B&#30340;&#24341;&#29992;&#35745;&#25968;&#22686;1
b['a'] = a  #A&#30340;&#24341;&#29992;&#35745;&#25968;&#22686;1
del a #A&#30340;&#24341;&#29992;&#20943; 1&#65292;&#26368;&#21518;A&#23545;&#35937;&#30340;&#24341;&#29992;&#20026; 1
del b #B&#30340;&#24341;&#29992;&#20943; 1, &#26368;&#21518;B&#23545;&#35937;&#30340;&#24341;&#29992;&#20026; 1
</pre></div>

<p><img alt="recycle-refrence.jpg" src="../images/recycle-refrence.jpg"/>
&#22312;&#36825;&#20010;&#20363;&#23376;&#20013;&#31243;&#24207;&#25191;&#34892;&#23436;<code>del</code>&#35821;&#21477;&#21518;&#65292;A&#12289;B&#23545;&#35937;&#24050;&#32463;&#27809;&#26377;&#20219;&#20309;&#24341;&#29992;&#25351;&#21521;&#36825;&#20004;&#20010;&#23545;&#35937;&#65292;&#20294;&#26159;&#36825;&#20004;&#20010;&#23545;&#35937;&#21508;&#21253;&#21547;&#19968;&#20010;&#23545;&#26041;&#23545;&#35937;&#30340;&#24341;&#29992;&#65292;&#34429;&#28982;&#26368;&#21518;&#20004;&#20010;&#23545;&#35937;&#37117;&#26080;&#27861;&#36890;&#36807;&#20854;&#23427;&#21464;&#37327;&#26469;&#24341;&#29992;&#36825;&#20004;&#20010;&#23545;&#35937;&#20102;&#65292;&#36825;&#23545;GC&#26469;&#35828;&#23601;&#26159;&#20004;&#20010;&#38750;&#27963;&#21160;&#23545;&#35937;&#25110;&#32773;&#35828;&#26159;&#22403;&#22334;&#23545;&#35937;&#65292;&#20294;&#26159;&#20182;&#20204;&#30340;&#24341;&#29992;&#35745;&#25968;&#24182;&#27809;&#26377;&#20943;&#23569;&#21040;&#38646;&#12290;&#22240;&#27492;&#22914;&#26524;&#26159;&#20351;&#29992;&#24341;&#29992;&#35745;&#25968;&#27861;&#26469;&#31649;&#29702;&#36825;&#20004;&#23545;&#35937;&#30340;&#35805;&#65292;&#20182;&#20204;&#24182;&#19981;&#20250;&#34987;&#22238;&#25910;&#65292;&#23427;&#20250;&#19968;&#30452;&#39547;&#30041;&#22312;&#20869;&#23384;&#20013;&#65292;&#23601;&#20250;&#36896;&#25104;&#20102;&#20869;&#23384;&#27844;&#28431;&#65288;&#20869;&#23384;&#31354;&#38388;&#22312;&#20351;&#29992;&#23436;&#27605;&#21518;&#26410;&#37322;&#25918;&#65289;&#12290;&#20026;&#20102;&#35299;&#20915;&#23545;&#35937;&#30340;&#24490;&#29615;&#24341;&#29992;&#38382;&#39064;&#65292;Python&#24341;&#20837;&#20102;&#26631;&#35760;-&#28165;&#38500;&#21644;&#20998;&#20195;&#22238;&#25910;&#20004;&#31181;GC&#26426;&#21046;&#12290;</p>
<h3>&#26631;&#35760;&#28165;&#38500;</h3>
<p>&#12302;&#26631;&#35760;&#28165;&#38500;&#65288;Mark&#8212;Sweep&#65289;&#12303;&#31639;&#27861;&#26159;&#19968;&#31181;&#22522;&#20110;&#36861;&#36394;&#22238;&#25910;&#65288;tracing GC&#65289;&#25216;&#26415;&#23454;&#29616;&#30340;&#22403;&#22334;&#22238;&#25910;&#31639;&#27861;&#12290;&#23427;&#20998;&#20026;&#20004;&#20010;&#38454;&#27573;&#65306;&#31532;&#19968;&#38454;&#27573;&#26159;&#26631;&#35760;&#38454;&#27573;&#65292;GC&#20250;&#25226;&#25152;&#26377;&#30340;&#12302;&#27963;&#21160;&#23545;&#35937;&#12303;&#25171;&#19978;&#26631;&#35760;&#65292;&#31532;&#20108;&#38454;&#27573;&#26159;&#25226;&#37027;&#20123;&#27809;&#26377;&#26631;&#35760;&#30340;&#23545;&#35937;&#12302;&#38750;&#27963;&#21160;&#23545;&#35937;&#12303;&#36827;&#34892;&#22238;&#25910;&#12290;&#37027;&#20040;GC&#21448;&#26159;&#22914;&#20309;&#21028;&#26029;&#21738;&#20123;&#26159;&#27963;&#21160;&#23545;&#35937;&#21738;&#20123;&#26159;&#38750;&#27963;&#21160;&#23545;&#35937;&#30340;&#21602;&#65311;</p>
<p>&#23545;&#35937;&#20043;&#38388;&#36890;&#36807;&#24341;&#29992;&#65288;&#25351;&#38024;&#65289;&#36830;&#22312;&#19968;&#36215;&#65292;&#26500;&#25104;&#19968;&#20010;&#26377;&#21521;&#22270;&#65292;&#23545;&#35937;&#26500;&#25104;&#36825;&#20010;&#26377;&#21521;&#22270;&#30340;&#33410;&#28857;&#65292;&#32780;&#24341;&#29992;&#20851;&#31995;&#26500;&#25104;&#36825;&#20010;&#26377;&#21521;&#22270;&#30340;&#36793;&#12290;&#20174;&#26681;&#23545;&#35937;&#65288;root object&#65289;&#20986;&#21457;&#65292;&#27839;&#30528;&#26377;&#21521;&#36793;&#36941;&#21382;&#23545;&#35937;&#65292;&#21487;&#36798;&#30340;&#65288;reachable&#65289;&#23545;&#35937;&#26631;&#35760;&#20026;&#27963;&#21160;&#23545;&#35937;&#65292;&#19981;&#21487;&#36798;&#30340;&#23545;&#35937;&#23601;&#26159;&#35201;&#34987;&#28165;&#38500;&#30340;&#38750;&#27963;&#21160;&#23545;&#35937;&#12290;&#26681;&#23545;&#35937;&#23601;&#26159;&#20840;&#23616;&#21464;&#37327;&#12289;&#35843;&#29992;&#26632;&#12289;&#23492;&#23384;&#22120;&#12290;
<img alt="mark-sweepg" src="../images/mark-sweep.svg"/>
&#22312;&#19978;&#22270;&#20013;&#65292;&#25105;&#20204;&#25226;&#23567;&#40657;&#22280;&#35270;&#20026;&#20840;&#23616;&#21464;&#37327;&#65292;&#20063;&#23601;&#26159;&#25226;&#23427;&#20316;&#20026;root object&#65292;&#20174;&#23567;&#40657;&#22280;&#20986;&#21457;&#65292;&#23545;&#35937;1&#21487;&#30452;&#36798;&#65292;&#37027;&#20040;&#23427;&#23558;&#34987;&#26631;&#35760;&#65292;&#23545;&#35937;2&#12289;3&#21487;&#38388;&#25509;&#21040;&#36798;&#20063;&#20250;&#34987;&#26631;&#35760;&#65292;&#32780;4&#21644;5&#19981;&#21487;&#36798;&#65292;&#37027;&#20040;1&#12289;2&#12289;3&#23601;&#26159;&#27963;&#21160;&#23545;&#35937;&#65292;4&#21644;5&#26159;&#38750;&#27963;&#21160;&#23545;&#35937;&#20250;&#34987;GC&#22238;&#25910;&#12290;</p>
<p>&#26631;&#35760;&#28165;&#38500;&#31639;&#27861;&#20316;&#20026;Python&#30340;&#36741;&#21161;&#22403;&#22334;&#25910;&#38598;&#25216;&#26415;&#20027;&#35201;&#22788;&#29702;&#30340;&#26159;&#19968;&#20123;&#23481;&#22120;&#23545;&#35937;&#65292;&#27604;&#22914;list&#12289;dict&#12289;tuple&#65292;instance&#31561;&#65292;&#22240;&#20026;&#23545;&#20110;&#23383;&#31526;&#20018;&#12289;&#25968;&#20540;&#23545;&#35937;&#26159;&#19981;&#21487;&#33021;&#36896;&#25104;&#24490;&#29615;&#24341;&#29992;&#38382;&#39064;&#12290;Python&#20351;&#29992;&#19968;&#20010;&#21452;&#21521;&#38142;&#34920;&#23558;&#36825;&#20123;&#23481;&#22120;&#23545;&#35937;&#32452;&#32455;&#36215;&#26469;&#12290;&#19981;&#36807;&#65292;&#36825;&#31181;&#31616;&#21333;&#31895;&#26292;&#30340;&#26631;&#35760;&#28165;&#38500;&#31639;&#27861;&#20063;&#26377;&#26126;&#26174;&#30340;&#32570;&#28857;&#65306;&#28165;&#38500;&#38750;&#27963;&#21160;&#30340;&#23545;&#35937;&#21069;&#23427;&#24517;&#39035;&#39034;&#24207;&#25195;&#25551;&#25972;&#20010;&#22534;&#20869;&#23384;&#65292;&#21738;&#24597;&#21482;&#21097;&#19979;&#23567;&#37096;&#20998;&#27963;&#21160;&#23545;&#35937;&#20063;&#35201;&#25195;&#25551;&#25152;&#26377;&#23545;&#35937;&#12290;</p>
<h3>&#20998;&#20195;&#22238;&#25910;</h3>
<p>&#20998;&#20195;&#22238;&#25910;&#26159;&#19968;&#31181;&#20197;&#31354;&#38388;&#25442;&#26102;&#38388;&#30340;&#25805;&#20316;&#26041;&#24335;&#65292;Python&#23558;&#20869;&#23384;&#26681;&#25454;&#23545;&#35937;&#30340;&#23384;&#27963;&#26102;&#38388;&#21010;&#20998;&#20026;&#19981;&#21516;&#30340;&#38598;&#21512;&#65292;&#27599;&#20010;&#38598;&#21512;&#31216;&#20026;&#19968;&#20010;&#20195;&#65292;Python&#23558;&#20869;&#23384;&#20998;&#20026;&#20102;3&#8220;&#20195;&#8221;&#65292;&#20998;&#21035;&#20026;&#24180;&#36731;&#20195;&#65288;&#31532;0&#20195;&#65289;&#12289;&#20013;&#24180;&#20195;&#65288;&#31532;1&#20195;&#65289;&#12289;&#32769;&#24180;&#20195;&#65288;&#31532;2&#20195;&#65289;&#65292;&#20182;&#20204;&#23545;&#24212;&#30340;&#26159;3&#20010;&#38142;&#34920;&#65292;&#23427;&#20204;&#30340;&#22403;&#22334;&#25910;&#38598;&#39057;&#29575;&#19982;&#23545;&#35937;&#30340;&#23384;&#27963;&#26102;&#38388;&#30340;&#22686;&#22823;&#32780;&#20943;&#23567;&#12290;&#26032;&#21019;&#24314;&#30340;&#23545;&#35937;&#37117;&#20250;&#20998;&#37197;&#22312;&#24180;&#36731;&#20195;&#65292;&#24180;&#36731;&#20195;&#38142;&#34920;&#30340;&#24635;&#25968;&#36798;&#21040;&#19978;&#38480;&#26102;&#65292;Python&#22403;&#22334;&#25910;&#38598;&#26426;&#21046;&#23601;&#20250;&#34987;&#35302;&#21457;&#65292;&#25226;&#37027;&#20123;&#21487;&#20197;&#34987;&#22238;&#25910;&#30340;&#23545;&#35937;&#22238;&#25910;&#25481;&#65292;&#32780;&#37027;&#20123;&#19981;&#20250;&#22238;&#25910;&#30340;&#23545;&#35937;&#23601;&#20250;&#34987;&#31227;&#21040;&#20013;&#24180;&#20195;&#21435;&#65292;&#20381;&#27492;&#31867;&#25512;&#65292;&#32769;&#24180;&#20195;&#20013;&#30340;&#23545;&#35937;&#26159;&#23384;&#27963;&#26102;&#38388;&#26368;&#20037;&#30340;&#23545;&#35937;&#65292;&#29978;&#33267;&#26159;&#23384;&#27963;&#20110;&#25972;&#20010;&#31995;&#32479;&#30340;&#29983;&#21629;&#21608;&#26399;&#20869;&#12290;&#21516;&#26102;&#65292;&#20998;&#20195;&#22238;&#25910;&#26159;&#24314;&#31435;&#22312;&#26631;&#35760;&#28165;&#38500;&#25216;&#26415;&#22522;&#30784;&#20043;&#19978;&#12290;&#20998;&#20195;&#22238;&#25910;&#21516;&#26679;&#20316;&#20026;Python&#30340;&#36741;&#21161;&#22403;&#22334;&#25910;&#38598;&#25216;&#26415;&#22788;&#29702;&#37027;&#20123;&#23481;&#22120;&#23545;&#35937;</p>
<p>&#21442;&#32771;&#65306;</p>
<ul>
<li><a href="http://www.memorymanagement.org/mmref/recycle.html#tracing-collectors">http://www.memorymanagement.org/mmref/recycle.html#tracing-collectors</a></li>
<li>&#12298;&#22403;&#22334;&#22238;&#25910;&#30340;&#31639;&#27861;&#19982;&#23454;&#29616;&#12299;</li>
<li>&#12298;Python&#28304;&#30721;&#21078;&#26512;&#12299;</li>
</ul>
        <br/>
        </article>

<p>Original:https://foofish.net/python-gc.html</p>
                </div><!-- /.entry-content -->
                <!-- 来必力City版安装代码 -->
                <div id="lv-container" data-id="city" data-uid="MTAyMC8zNjgwNi8xMzM0Mg==">
                    <script type="text/javascript">
                   (function(d, s) {
                       var j, e = d.getElementsByTagName(s)[0];

                       if (typeof LivereTower === 'function') { return; }

                       j = d.createElement(s);
                       j.src = 'https://cdn-city.livere.com/js/embed.dist.js';
                       j.async = true;

                       e.parentNode.insertBefore(j, e);
                   })(document, 'script');
                    </script>
                <noscript> 为正常使用来必力评论功能请激活JavaScript</noscript>
                </div>
                <!-- City版安装代码已完成 -->
        </article>
</section>
        </div><!--/span-->

                <div class="span3 well sidebar-nav" id="sidebar">
<ul class="nav nav-list">
<li class="nav-header"><h4><i class="icon-external-link"></i>blogroll</h4></li>
    <li><a href="http://getpelican.com/"><i class="icon-external-link"></i>Pelican</a></li>
    <li><a href="http://python.org/"><i class="icon-external-link"></i>Python.org</a></li>
    <li><a href="http://jinja.pocoo.org/"><i class="icon-external-link"></i>Jinja2</a></li>
    <li><a href="http://www.runoob.com/"><i class="icon-external-link"></i>Python教程</a></li>
    <li><a href="https://www.liaoxuefeng.com/wiki/0014316089557264a6b348958f449949df42a6d3a2e542c000"><i class="icon-external-link"></i>廖雪峰Python</a></li>
<li class="nav-header"><h4><i class="icon-home icon-large"></i> social</h4></li>
<li><a href="/feeds/all.atom.xml" rel="alternate"><i class="icon-bookmark icon-large"></i>atom feed</a></li>
    <li><a href="https://github.com/RuiJee"><i class="icon-Github-sign icon-large"></i>Github</a></li>

<li class="nav-header"><h4> <a href="/categories.html"><i class="icon-folder-close icon-large"></i>Categories</a></h4></li>
<li>
<a href="/category/code-example/index.html">
    <i class="icon-folder-open icon-large"></i>Code Example
</a>
</li>
<li>
<a href="/category/linux/index.html">
    <i class="icon-folder-open icon-large"></i>Linux
</a>
</li>
<li>
<a href="/category/pa-chong-ji-zhu/index.html">
    <i class="icon-folder-open icon-large"></i>爬虫技术
</a>
</li>
<li>
<a href="/category/pythonji-zhu/index.html">
    <i class="icon-folder-open icon-large"></i>Python技术
</a>
</li>

<li class="nav-header"><h4> <a href="/tags.html"><i class="icon-tags icon-large"></i>Tags</a></h4></li>
<li class="tag-2">
    <a href="/tag/pa-chong/index.html">
        <i class="icon-tag icon-large"></i>爬虫
    </a>
</li>
<li class="tag-4">
    <a href="/tag/biao-qian-yun/index.html">
        <i class="icon-tag icon-large"></i>标签云
    </a>
</li>
<li class="tag-3">
    <a href="/tag/dict/index.html">
        <i class="icon-tag icon-large"></i>dict
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_gui/index.html">
        <i class="icon-tag icon-large"></i>code_gui
    </a>
</li>
<li class="tag-4">
    <a href="/tag/lsof/index.html">
        <i class="icon-tag icon-large"></i>lsof
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_scripts-shell/index.html">
        <i class="icon-tag icon-large"></i>code_scripts-shell
    </a>
</li>
<li class="tag-4">
    <a href="/tag/ci-yun/index.html">
        <i class="icon-tag icon-large"></i>词云
    </a>
</li>
<li class="tag-4">
    <a href="/tag/shu/index.html">
        <i class="icon-tag icon-large"></i>书
    </a>
</li>
<li class="tag-4">
    <a href="/tag/equals-identical/index.html">
        <i class="icon-tag icon-large"></i>equals-identical
    </a>
</li>
<li class="tag-4">
    <a href="/tag/thread/index.html">
        <i class="icon-tag icon-large"></i>thread
    </a>
</li>
<li class="tag-3">
    <a href="/tag/iterator/index.html">
        <i class="icon-tag icon-large"></i>iterator
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_linux/index.html">
        <i class="icon-tag icon-large"></i>code_linux
    </a>
</li>
<li class="tag-4">
    <a href="/tag/python27/index.html">
        <i class="icon-tag icon-large"></i>python27
    </a>
</li>
<li class="tag-4">
    <a href="/tag/dian-zi-shu/index.html">
        <i class="icon-tag icon-large"></i>电子书
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_algorithm/index.html">
        <i class="icon-tag icon-large"></i>code_algorithm
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_security/index.html">
        <i class="icon-tag icon-large"></i>code_security
    </a>
</li>
<li class="tag-4">
    <a href="/tag/virtualenv/index.html">
        <i class="icon-tag icon-large"></i>virtualenv
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_game/index.html">
        <i class="icon-tag icon-large"></i>code_game
    </a>
</li>
<li class="tag-4">
    <a href="/tag/extractor/index.html">
        <i class="icon-tag icon-large"></i>extractor
    </a>
</li>
<li class="tag-2">
    <a href="/tag/python/index.html">
        <i class="icon-tag icon-large"></i>python
    </a>
</li>
<li class="tag-3">
    <a href="/tag/list/index.html">
        <i class="icon-tag icon-large"></i>list
    </a>
</li>
<li class="tag-3">
    <a href="/tag/zhuang-shi-qi/index.html">
        <i class="icon-tag icon-large"></i>装饰器
    </a>
</li>
<li class="tag-4">
    <a href="/tag/rename/index.html">
        <i class="icon-tag icon-large"></i>rename
    </a>
</li>
<li class="tag-4">
    <a href="/tag/beautifulsoup/index.html">
        <i class="icon-tag icon-large"></i>beautifulsoup
    </a>
</li>
<li class="tag-4">
    <a href="/tag/lambda/index.html">
        <i class="icon-tag icon-large"></i>lambda
    </a>
</li>
<li class="tag-4">
    <a href="/tag/luan-ma/index.html">
        <i class="icon-tag icon-large"></i>乱码
    </a>
</li>
<li class="tag-4">
    <a href="/tag/pip/index.html">
        <i class="icon-tag icon-large"></i>pip
    </a>
</li>
<li class="tag-4">
    <a href="/tag/datetime/index.html">
        <i class="icon-tag icon-large"></i>datetime
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_demos/index.html">
        <i class="icon-tag icon-large"></i>code_Demos
    </a>
</li>
<li class="tag-4">
    <a href="/tag/legb/index.html">
        <i class="icon-tag icon-large"></i>legb
    </a>
</li>
<li class="tag-4">
    <a href="/tag/ming-ming-kong-jian/index.html">
        <i class="icon-tag icon-large"></i>命名空间
    </a>
</li>
<li class="tag-4">
    <a href="/tag/cai-dan/index.html">
        <i class="icon-tag icon-large"></i>彩蛋
    </a>
</li>
<li class="tag-4">
    <a href="/tag/tornado/index.html">
        <i class="icon-tag icon-large"></i>tornado
    </a>
</li>
<li class="tag-4">
    <a href="/tag/metaclass/index.html">
        <i class="icon-tag icon-large"></i>metaclass
    </a>
</li>
<li class="tag-4">
    <a href="/tag/tuple/index.html">
        <i class="icon-tag icon-large"></i>tuple
    </a>
</li>
<li class="tag-4">
    <a href="/tag/decorator/index.html">
        <i class="icon-tag icon-large"></i>decorator
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_mail/index.html">
        <i class="icon-tag icon-large"></i>code_mail
    </a>
</li>
<li class="tag-2">
    <a href="/tag/code_graphics/index.html">
        <i class="icon-tag icon-large"></i>code_graphics
    </a>
</li>
<li class="tag-4">
    <a href="/tag/fudge/index.html">
        <i class="icon-tag icon-large"></i>fudge
    </a>
</li>
<li class="tag-3">
    <a href="/tag/pycharm/index.html">
        <i class="icon-tag icon-large"></i>pycharm
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_other/index.html">
        <i class="icon-tag icon-large"></i>code_other
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_base/index.html">
        <i class="icon-tag icon-large"></i>code_base
    </a>
</li>
<li class="tag-4">
    <a href="/tag/code_mobile/index.html">
        <i class="icon-tag icon-large"></i>code_mobile
    </a>
</li>
<li class="tag-4">
    <a href="/tag/re/index.html">
        <i class="icon-tag icon-large"></i>re
    </a>
</li>
<li class="tag-4">
    <a href="/tag/zhi-hu/index.html">
        <i class="icon-tag icon-large"></i>知乎
    </a>
</li>
<li class="tag-4">
    <a href="/tag/with/index.html">
        <i class="icon-tag icon-large"></i>with
    </a>
</li>
<li class="tag-4">
    <a href="/tag/stringio/index.html">
        <i class="icon-tag icon-large"></i>stringio
    </a>
</li>
<li class="tag-4">
    <a href="/tag/method/index.html">
        <i class="icon-tag icon-large"></i>method
    </a>
</li>
<li class="tag-4">
    <a href="/tag/timestamp/index.html">
        <i class="icon-tag icon-large"></i>timestamp
    </a>
</li>
<li class="tag-4">
    <a href="/tag/singleton/index.html">
        <i class="icon-tag icon-large"></i>singleton
    </a>
</li>
<li class="tag-4">
    <a href="/tag/free/index.html">
        <i class="icon-tag icon-large"></i>free
    </a>
</li>
<li class="tag-4">
    <a href="/tag/gc/index.html">
        <i class="icon-tag icon-large"></i>gc
    </a>
</li>
<li class="tag-3">
    <a href="/tag/suan-fa/index.html">
        <i class="icon-tag icon-large"></i>算法
    </a>
</li>
<li class="tag-4">
    <a href="/tag/bi-bao/index.html">
        <i class="icon-tag icon-large"></i>闭包
    </a>
</li>
<li class="tag-2">
    <a href="/tag/linux/index.html">
        <i class="icon-tag icon-large"></i>linux
    </a>
</li>
<li class="tag-4">
    <a href="/tag/iterable/index.html">
        <i class="icon-tag icon-large"></i>iterable
    </a>
</li>
<li class="tag-1">
    <a href="/tag/code_text-file/index.html">
        <i class="icon-tag icon-large"></i>code_text-file
    </a>
</li>
<li class="tag-4">
    <a href="/tag/int/index.html">
        <i class="icon-tag icon-large"></i>int
    </a>
</li>
<li class="tag-3">
    <a href="/tag/http/index.html">
        <i class="icon-tag icon-large"></i>http
    </a>
</li>
<li class="tag-4">
    <a href="/tag/intern/index.html">
        <i class="icon-tag icon-large"></i>intern
    </a>
</li>
<li class="tag-4">
    <a href="/tag/ru-men/index.html">
        <i class="icon-tag icon-large"></i>入门
    </a>
</li>
<li class="tag-4">
    <a href="/tag/djang-blog/index.html">
        <i class="icon-tag icon-large"></i>djang-blog
    </a>
</li>
<li class="tag-4">
    <a href="/tag/zuo-yong-yu/index.html">
        <i class="icon-tag icon-large"></i>作用域
    </a>
</li>
<li class="tag-4">
    <a href="/tag/str/index.html">
        <i class="icon-tag icon-large"></i>str
    </a>
</li>
<li class="tag-2">
    <a href="/tag/bian-ma/index.html">
        <i class="icon-tag icon-large"></i>编码
    </a>
</li>
<li class="tag-4">
    <a href="/tag/yield/index.html">
        <i class="icon-tag icon-large"></i>yield
    </a>
</li>
<li class="tag-3">
    <a href="/tag/pythonic/index.html">
        <i class="icon-tag icon-large"></i>pythonic
    </a>
</li>
<li class="tag-4">
    <a href="/tag/for/index.html">
        <i class="icon-tag icon-large"></i>for
    </a>
</li>
<li class="tag-4">
    <a href="/tag/django/index.html">
        <i class="icon-tag icon-large"></i>django
    </a>
</li>
<li class="tag-4">
    <a href="/tag/centos/index.html">
        <i class="icon-tag icon-large"></i>centos
    </a>
</li>
<li class="tag-3">
    <a href="/tag/generator/index.html">
        <i class="icon-tag icon-large"></i>generator
    </a>
</li>
<li class="tag-4">
    <a href="/tag/zheng-ze-biao-da-shi/index.html">
        <i class="icon-tag icon-large"></i>正则表达式
    </a>
</li>
<li class="tag-3">
    <a href="/tag/python3/index.html">
        <i class="icon-tag icon-large"></i>python3
    </a>
</li>
<li class="tag-3">
    <a href="/tag/han-shu/index.html">
        <i class="icon-tag icon-large"></i>函数
    </a>
</li>
<li class="tag-4">
    <a href="/tag/jie-huo/index.html">
        <i class="icon-tag icon-large"></i>解惑
    </a>
</li>
<li class="tag-3">
    <a href="/tag/shi-xian-yuan-li/index.html">
        <i class="icon-tag icon-large"></i>实现原理
    </a>
</li>
<li class="tag-3">
    <a href="/tag/requests/index.html">
        <i class="icon-tag icon-large"></i>requests
    </a>
</li>
<li class="tag-4">
    <a href="/tag/book/index.html">
        <i class="icon-tag icon-large"></i>book
    </a>
</li>


</ul>        </div><!--/.well -->

      </div><!--/row-->

      <hr>

      <footer>
        <!--<address id="about">
                Proudly powered by <a href="http://pelican.notmyidea.org/">Pelican <i class="icon-external-link"></i></a>,
                                which takes great advantage of <a href="http://python.org">Python <i class="icon-external-link"></i></a>.
        </address>--><!-- /#about -->

       <!-- <p>The theme is from <a href="http://twitter.github.com/bootstrap/">Bootstrap from Twitter <i class="icon-external-link"></i></a>,
                   and <a href="http://fortawesome.github.com/Font-Awesome/">Font-Awesome <i class="icon-external-link"></i></a>, thanks!</p>-->
         <p>&copy; Alex 2018</p>
      </footer>

    </div><!--/.fluid-container-->



    <!-- Le javascript -->
    <!-- Placed at the end of the document so the pages load faster -->
    <!--<script src="/theme/js/jquery-1.7.2.min.js"></script>-->
    <script src="/theme/js/bootstrap.min.js"></script>
  </body>
</html>